
{
    "tutorial": [
        {
            "chapter_nr": 1,
            "topic": "output command: System.out.println()",
            "content": "<h1 class=\"western\">Kapitel 1 - Hallo Welt</h1>\n<p>Rechts siehst du ein &quot;Hallo Welt&quot; Programm.</p>\n<p>In vielen Programmiersprachen ist\ndies das erste Programm, das man schreibt. Es macht nichts weiter,\nals dass es die Worte &quot;Hallo Welt&quot; ausgibt.</p>\n<p>Im ersten Kapitel lernst du mit Hilfe\ndieses einfachen Programms einige Regeln für Java kennen. Du wirst\nhier schon auf einige Begriffe stoßen, die am Anfang noch unklar\nsind und die du erst im Laufe dieses Lehrgangs richtig verstehen\nwirst. Mach dir darum keine Sorgen.</p>\n<p>Das Programm besteht aus einer Klasse\nmit dem Namen &quot;Main&quot;:</p>\n<pre class=\"western\"><code class=\"western\">public class Main {\n<code class=\"western\">     </code>...\n}</code></pre>\n<p>Da das Programm nur aus einer Klasse besteht, ist dies die\nHauptklasse. Jede Java Datei hat die Erweiterung <b>.java </b>und\nbesitzt eine Hauptklasse mit dem gleichen Namen wie die Datei. Dieses\nProgramm würde also unter dem Namen <b>Main.java</b> abgespeichert.</p>\n<p>Du wirst noch genauer erfahren, was\nman bei der Programmierung unter einer Klasse versteht.</p>\n<p>Zunächst kannst du dir eine Klasse\nals ein Konzept mit einer Aufgabe vorstellen. Die Aufgabe dieser\nKlasse ist die Ausgabe der Texts &quot;Hallo Welt&quot;.</p>\n<p>Klassennamen schreibt man in der\nRegel groß. Die geschweiften Klammern geben an, was alles zu der\nKlasse hinzu gehört.</p>\n<p>In der Klasse befindet sich eine\n<b>Methode</b> main(), die die Aufgabe des Programms enthält:</p>\n<pre class=\"western\"><code class=\"western\">public static void main(String[] args) {\n<code class=\"western\">     </code>...\n}</code></pre>\n<p>Der Name einer Methode endet immer mit runden Klammern. Später wirst\ndu sehen, dass es auch Methoden gibt, bei denen nichts in der Klammer\nsteht. Trotzdem müssen die runden Klammern immer am Ende des Namens\nvorhanden sein.</p>\n<p>Wie bei der Klasse zeigen die\ngeschweiften Klammern an, was zu der Methode hinzu gehört.</p>\n<p>Die Begriffe <b>public</b>, <b>static</b>,\n<b>void</b> und <b>String[] args</b> werden wir später genauer\nverstehen. Fürs erste reicht es zu verstehen, dass sie (notwendige)\nEigenschaften der Methode beschreiben.</p>\n<p>Der entscheidende Befehl für das\nProgramm ist:</p>\n<pre class=\"western\"><code class=\"western\">System.out.println(&quot;Hallo Welt&quot;);</code></pre><p>\nDieser Befehl weist den Computer an, den Text &quot;Hallo Welt&quot;\nauszugeben.</p>\n<p>Der Befehl ist zusammengesetzt aus\neinzelnen Komponenten (zu erkennen an den Punkten). Du wirst bald\nverstehen, was die einzelnen Teile bedeuten. Fürs Erste kannst du\ndir merken, dass man mit diesem Befehl Text ausgeben kann.</p>\n<br>",
            "assignment": "<h2>Aufgabe</h2>\n<p>Ändere das Programm so ab, dass es nicht mehr \"Hallo Welt\", sondern \"Hello World\" ausgibt.</p>\n",
            "java": "public class Main {\n    public static void main(String[] args) {\n        System.out.println(\"Hallo Welt!\");\n    }\n}"
        },
        {
            "chapter_nr": 2,
            "topic": "commenting code",
            "content": "<h1 class=\"western\">Kapitel 2 - Kommentare im Code</h1>\n<p>In der Programmierung ist es wichtig, den Code verständlich zu halten. Eine Möglichkeit, dies zu tun, ist die Verwendung von Kommentaren.</p>\n<p>Kommentare sind Texte im Code, die vom Computer ignoriert werden. Sie dienen dazu, den Code zu erklären oder Notizen für dich selbst oder andere Programmierer zu hinterlassen.</p>\n<p>In Java gibt es zwei Arten von Kommentaren:</p>\n<ul>\n    <li><b>Einzeilige Kommentare:</b> Diese beginnen mit zwei Schrägstrichen <code>//</code>. Alles, was nach diesen Zeichen kommt, wird als Kommentar betrachtet.</li>\n    <li><b>Mehrzeilige Kommentare:</b> Diese beginnen mit <code>/*</code> und enden mit <code>*/</code>. Alles dazwischen wird als Kommentar betrachtet, egal wie viele Zeilen es sind.</li>\n</ul>\n<p>Hier ist ein Beispiel für einen einzeiligen Kommentar:</p>\n<pre class=\"western\"><code class=\"western\">// Dies ist ein Kommentar</code></pre>\n<p>Und hier ist ein Beispiel für einen mehrzeiligen Kommentar:</p>\n<pre class=\"western\"><code class=\"western\">/*\nDies ist ein mehrzeiliger Kommentar.\nEr kann über mehrere Zeilen gehen.\n*/</code></pre>\n<p>Kommentare sind sehr nützlich, um den Code zu dokumentieren und um zu erklären, was bestimmte Teile des Codes tun. Es ist eine gute Praxis, Kommentare zu verwenden, um den Code lesbarer zu machen.</p>\n<br>",
            "assignment": "<h2>Aufgabe</h2>\n<p>Füge deinem Programm Kommentare hinzu, um zu erklären, was jeder Teil des Codes macht. Erstelle sowohl einzeilige als auch mehrzeilige Kommentare.</p>\n",
            "java": "public class Main {\n    public static void main(String[] args) {\n        todo ...\n        System.out.println(\"Dies ist der Beginn eines Kurses, der dir Java beibringen soll.\");\n        todo ... \n        System.out.println(\"Am Ende des Kurses wirst du die Grundlagen der Programmierung mit Java beherrschen\");\n    }\n}"
        },
        {
            "chapter_nr": 3,
            "topic": "data types: boolean, int, float, double, char, String and declaration and initialization of variables",
            "content": "<h1 class=\"western\">Kapitel 3 - Grundlegende Datentypen und Variablen</h1>\n<p>In der Programmierung ist es wichtig, Daten zu speichern und zu verarbeiten. In Java gibt es verschiedene Arten von Daten, die wir als <b>Datentypen</b> bezeichnen. Die häufigsten Datentypen sind:</p>\n<ul>\n    <li><b>int:</b> Dieser Datentyp wird verwendet, um ganze Zahlen zu speichern, wie z.B. 1, 2 oder -5.</li>\n    <li><b>double:</b> Dieser Datentyp wird verwendet, um Dezimalzahlen zu speichern, wie z.B. 3.14 oder -0.001.</li>\n    <li><b>char:</b> Dieser Datentyp wird verwendet, um ein einzelnes Zeichen zu speichern, wie z.B. 'a' oder 'Z'.</li>\n    <li><b>boolean:</b> Dieser Datentyp wird verwendet, um Wahrheitswerte zu speichern, die entweder <code>true</code> oder <code>false</code> sein können.</li>\n</ul>\n<p>Um eine Variable zu verwenden, musst du sie zuerst <b>deklarieren</b>. Das bedeutet, dass du dem Computer sagst, dass du eine Variable mit einem bestimmten Datentyp erstellen möchtest. Zum Beispiel:</p>\n<pre class=\"western\"><code class=\"western\">int zahl;</code></pre>\n<p>Hier haben wir eine Variable namens <code>zahl</code> deklariert, die eine ganze Zahl speichern kann. Um der Variable einen Wert zuzuweisen, verwenden wir das <b>Gleichheitszeichen</b>:</p>\n<pre class=\"western\"><code class=\"western\">zahl = 5;</code></pre>\n<p>Du kannst auch die Deklaration und die Zuweisung in einem Schritt durchführen:</p>\n<pre class=\"western\"><code class=\"western\">int zahl = 5;</code></pre>\n<p>Jetzt enthält die Variable <code>zahl</code> den Wert 5. Das nennt man <b>Initialisierung</b>.</p>\n<p>In diesem Kapitel hast du gelert, wie man Variablen deklariert und initialisiert, um verschiedene Datentypen zu verwenden.</p>\n<br>",
            "assignment": "<h2>Aufgabe</h2>\n<p>Erstelle ein Programm, das die folgenden Variablen deklariert und initialisiert:</p>\n<ul>\n    <li>Eine ganze Zahl (int) mit dem Namen <code>alter</code> und dem Wert 16.</li>\n    <li>Eine Dezimalzahl (double) mit dem Namen <code>gewicht</code> und dem Wert 65.5.</li>\n    <li>Ein Zeichen (char) mit dem Namen <code>anfangsBuchstabe</code> und dem Wert 'J'.</li>\n    <li>Ein Wahrheitswert (boolean) mit dem Namen <code>istStudent</code> und dem Wert <code>true</code>.</li>\n</ul>\n<p>Gib anschließend die Werte der Variablen in der Konsole aus.</p><p>Den Wert einer Variable x kann man z.B. mit dem folgenden Befehl ausgeben:</p>\n<pre class=\"western\"><code class=\"western\">System.out.println(\"Wert von x: \" + x);</code></pre>\n<p></p>\n",
            "java": "public class Main {\n    public static void main(String[] args) {\n        todo ...\n    }\n}"
        },
        {
            "chapter_nr": 4,
            "topic": "basic arithmetic operations",
            "content": "<h1 class=\"western\">Kapitel 4 - Grundlegende arithmetische Operationen</h1>\n<p>In der Programmierung ist es oft notwendig, mit Zahlen zu rechnen. Java bietet verschiedene arithmetische Operationen, die du verwenden kannst, um Berechnungen durchzuführen.</p>\n<p>Die grundlegenden arithmetischen Operationen sind:</p>\n<ul>\n    <li><b>Addition (+):</b> Diese Operation wird verwendet, um zwei Zahlen zu addieren.</li>\n    <li><b>Subtraktion (-):</b> Diese Operation wird verwendet, um eine Zahl von einer anderen zu subtrahieren.</li>\n    <li><b>Multiplikation (*):</b> Diese Operation wird verwendet, um zwei Zahlen zu multiplizieren.</li>\n    <li><b>Division (/):</b> Diese Operation wird verwendet, um eine Zahl durch eine andere zu dividieren.</li>\n</ul>\n<p>Hier ist ein einfaches Beispiel, das zeigt, wie man diese Operationen in Java verwenden kann:</p>\n<pre class=\"western\"><code class=\"western\">int a = 10;\nint b = 5;\nint summe = a + b; // Addition\nint differenz = a - b; // Subtraktion\nint produkt = a * b; // Multiplikation\nint quotient = a / b; // Division</code></pre>\n<p>In diesem Beispiel haben wir zwei Variablen <code>a</code> und <code>b</code> deklariert und ihnen Werte zugewiesen. Dann haben wir die vier grundlegenden arithmetischen Operationen durchgeführt und die Ergebnisse in neuen Variablen gespeichert.</p>\n<p>Du wirst lernen, wie man diese Operationen in deinen Programmen anwendet, um verschiedene Berechnungen durchzuführen.</p>\n<br>",
            "assignment": "<h2>Aufgabe</h2>\n<p>Erstelle ein Programm, das zwei (Dezimal-)Zahlen deklariert und die Aufgaben und Ergebnisse der vier grundlegenden arithmetischen Operationen (Addition, Subtraktion, Multiplikation und Division) ausgibt.</p>\n",
            "java": "public class Main {\n    public static void main(String[] args) {\n        // TODO: Deklariere und initialisiere zwei Variablen mit den Namen zahl1 und zahl2\n        // TODO: Führe die vier grundlegenden arithmetischen Operationen durch \n        // und speichere sie in den Variablen summe, differenz, produkt und quotient\n       int summe = \n       int differenz = \n       int produkt = \n       int quotient = \n       // TODO: Gib die Ergebnisse der Operationen aus\n    }\n}"
        },
        {
            "chapter_nr": 5,
            "topic": "input command: nextLine() via java.util.Scanner",
            "content": "<h1 class=\"western\">\nKapitel 5 - Eingabe</h1>\n<p>Häufig ist es notwendig, dass ein\nProgramm Informationen vom Nutzer während der Laufzeit erhält.</p>\n<p>In Java gibt es dafür eine\nsogenannte Scanner Klasse, die diese Funktionalität bereit stellt.\nDiese muss zu Beginn des Programms importiert werden mit:\n</p>\n<pre class=\"western\"><code class=\"western\">import java.util.Scanner;</code></pre>\n<p>Im Programm kann man dann (wie bekannt) ein Objekt der Klasse Scanner\nerstellen mit:</p>\n<pre class=\"western\"><code class=\"western\">Scanner scanner = new Scanner(System.in);</code></pre>\n<p><i>System.in</i> gibt dabei an, dass der Scanner den <i>standard input stream</i> (meistens die\nKommandozeile) als Quelle verwenden soll. Möglich wären hier auch\neinfach eine String Variable oder eine Datei.</p>\n<p>Jetzt kann man den <i>scanner</i>\ndazu verwenden, um Text vom Nutzer während der Laufzeit zu erhalten.\nMit dem Befehl</p>\n<pre class=\"western\"><code class=\"western\">String text = scanner.nextLine();</code></pre>\n<p>wird eine Zeile von der Quelle (im diesen Fall die Eingabe des\nNutzers) eingelesen und als Wert der Variable text zugeordnet.\n</p>\n<p>Hinweis: Die Eingabe des Nutzers wird\ndurch die <i>Enter </i>Taste auf der Tastatur beendet.\n</p>\n<br>",
            "assignment": "<h2>Aufgabe</h2>\n<p>Vervollständige das Programm, so dass es nach einem Username fragt und diesen unter der Variable userName abspeichert.\n        Anschließend soll das Programm den Text \"Der Username ist: userName\" ausgeben, wobei userName durch den Wert der Variable ersetzt wird. </p>\n",
            "java": "import java.util.Scanner;\n\nclass Main {\n  public static void main(String[] args) {\n    Scanner scanner = new Scanner(System.in);\n    todo ...\n  }\n}"
        },
        {
            "chapter_nr": 6,
            "topic": "if-else statements and relational and logical operators",
            "content": "<h1 class=\"western\">Kapitel 6 - if-else-Anweisungen und relationale sowie logische Operatoren</h1>\n<p>In der Programmierung ist es oft notwendig, Entscheidungen zu treffen. Dies geschieht in Java mit <b>if-else-Anweisungen</b>. Mit diesen Anweisungen kannst du überprüfen, ob eine Bedingung wahr oder falsch ist, und entsprechend darauf reagieren.</p>\n<p>Hier ist ein einfaches Beispiel:</p>\n<pre class=\"western\"><code class=\"western\">int zahl = 10;\nif (zahl > 5) {\n    System.out.println(\"Die Zahl ist größer als 5.\");\n} else {\n    System.out.println(\"Die Zahl ist 5 oder kleiner.\");\n}</code></pre>\n<p>In diesem Beispiel wird überprüft, ob die Variable <code>zahl</code> größer als 5 ist. Wenn dies der Fall ist, wird die erste Nachricht ausgegeben. Andernfalls wird die zweite Nachricht ausgegeben.</p>\n<p>Zusätzlich zu <b>if-else-Anweisungen</b> gibt es auch <b>relationale Operatoren</b>, die verwendet werden, um Vergleiche zwischen Werten anzustellen. Die häufigsten relationalen Operatoren sind:</p>\n<ul>\n    <li><code>==</code> (gleich)</li>\n    <li><code>!=</code> (ungleich)</li>\n    <li><code>&gt;</code> (größer als)</li>\n    <li><code>&lt;</code> (kleiner als)</li>\n    <li><code>&gt;=</code> (größer oder gleich)</li>\n    <li><code>&lt;=</code> (kleiner oder gleich)</li>\n</ul>\n<p>Außerdem gibt es <b>logische Operatoren</b>, die verwendet werden, um mehrere Bedingungen zu kombinieren:</p>\n<ul>\n    <li><code>&&</code> (logisches UND)</li>\n    <li><code>||</code> (logisches ODER)</li>\n    <li><code>!</code> (logische Negation)</li>\n</ul>\n<p>In diesem Kapitel wirst du lernen, wie man <b>if-else-Anweisungen</b> verwendet, um Entscheidungen in deinem Programm zu treffen, und wie man relationale sowie logische Operatoren anwendet.</p>\n<br>",
            "assignment": "<h2>Aufgabe</h2>\n<p>Erstelle ein Programm, das eine Zahl von der Benutzereingabe einliest und überprüft, ob die Zahl gerade oder ungerade ist. Gib eine entsprechende Nachricht aus.</p>\n",
            "java": "import java.util.Scanner;\n\nclass Main {\n    public static void main(String[] args) {\n        Scanner scanner = new Scanner(System.in);\n        // TODO: Lese eine Zahl von der Benutzereingabe ein\n        int zahl = 0; // Beispielwert\n\n        // TODO: Überprüfe, ob die Zahl gerade oder ungerade ist\n        if (zahl % 2 == 0) {\n            System.out.println(\"Die Zahl ist gerade.\");\n        } else {\n            System.out.println(\"Die Zahl ist ungerade.\");\n        }\n    }\n}"
        },
        {
            "chapter_nr": 7,
            "topic": "switch-case structure",
            "content": "<h1 class=\"western\">Kapitel 7 - Die switch-case Struktur</h1>\n<p>In der Programmierung ist es oft notwendig, verschiedene Bedingungen zu überprüfen und basierend auf diesen Bedingungen unterschiedliche Aktionen auszuführen. Eine Möglichkeit, dies zu tun, ist die Verwendung der <b>switch-case</b> Struktur.</p>\n<p>Die <b>switch</b> Anweisung ermöglicht es dir, eine Variable zu überprüfen und verschiedene Fälle zu definieren, die ausgeführt werden, wenn die Variable einen bestimmten Wert hat.</p>\n<p>Hier ist ein einfaches Beispiel:</p>\n<pre class=\"western\"><code class=\"western\">int tag = 3;\n\nswitch (tag) {\n    case 1:\n        System.out.println(\"Montag\");\n        break;\n    case 2:\n        System.out.println(\"Dienstag\");\n        break;\n    case 3:\n        System.out.println(\"Mittwoch\");\n        break;\n    default:\n        System.out.println(\"Ungültiger Tag\");\n}</code></pre>\n<p>In diesem Beispiel wird die Variable <code>tag</code> überprüft. Wenn <code>tag</code> den Wert 3 hat, wird die Nachricht \"Mittwoch\" ausgegeben. Der <code>break</code> Befehl sorgt dafür, dass die Ausführung der switch-Anweisung nach dem entsprechenden Fall beendet wird.</p>\n<p>Wenn keiner der definierten Fälle zutrifft, wird der <code>default</code> Fall ausgeführt, der eine Standardnachricht ausgibt.</p>\n<p>Die <b>switch-case</b> Struktur ist besonders nützlich, wenn du viele Bedingungen überprüfen musst, da sie den Code übersichtlicher macht als viele <b>if-else</b> Anweisungen.</p>\n<br>",
            "assignment": "<h2>Aufgabe</h2>\n<p>Erstelle ein Programm, das eine Zahl zwischen 1 und 5 einliest und den entsprechenden Wochentag ausgibt. Verwende die <b>switch-case</b> Struktur, um die Wochentage zu definieren.</p>\n",
            "java": "import java.util.Scanner;\n\nclass Main {\n    public static void main(String[] args) {\n        Scanner scanner = new Scanner(System.in);\n        // TODO: Lese eine Zahl zwischen 1 und 5 ein\n        // TODO: Verwende die switch-case Struktur, um den entsprechenden Wochentag auszugeben\n    }\n}"
        },
        {
            "chapter_nr": 8,
            "topic": "for loop",
            "content": "<h1 class=\"western\">Kapitel 8 - Die for-Schleife</h1>\n<p>In der Programmierung ist es oft notwendig, einen bestimmten Codeblock mehrmals auszuführen. Eine Möglichkeit, dies zu tun, ist die Verwendung einer <b>for-Schleife</b>.</p>\n<p>Eine <b>for-Schleife</b> ermöglicht es dir, eine bestimmte Anzahl von Wiederholungen durchzuführen. Sie wird häufig verwendet, wenn die Anzahl der Wiederholungen im Voraus bekannt ist.</p>\n<p>Hier ist die allgemeine Struktur einer for-Schleife:</p>\n<pre class=\"western\"><code class=\"western\">for (initialisierung; bedingung; schritt) {\n    // Code, der wiederholt werden soll\n}</code></pre>\n<p>Die <b>initialisierung</b> wird einmal zu Beginn der Schleife ausgeführt. Die <b>bedingung</b> wird vor jeder Wiederholung überprüft. Wenn die Bedingung wahr ist, wird der Code innerhalb der Schleife ausgeführt. Nach jeder Ausführung wird der <b>schritt</b> ausgeführt, der in der Regel die Schleifenvariable verändert.</p>\n<p>Hier ist ein einfaches Beispiel, das die Verwendung einer for-Schleife zeigt:</p>\n<pre class=\"western\"><code class=\"western\">for (int i = 0; i &lt; 5; i++) {\n    System.out.println(\"Wert von i: \" + i);\n}</code></pre>\n<p>In diesem Beispiel wird die Schleife fünfmal durchlaufen, und bei jedem Durchlauf wird der aktuelle Wert von <code>i</code> ausgegeben.</p>\n<p>Die for-Schleife ist besonders nützlich, wenn du mit Reihungen (Arrays) arbeitest, da du so einfach durch die Elemente durchgehen kannst. Was Arrays sind, wirst du in einem der nächsten Kapitel lernen.</p>\n<br>",
            "assignment": "<h2>Aufgabe</h2>\n<p>Erstelle ein Programm, das die Zahlen von 1 bis 10 mit einer for-Schleife ausgibt.</p>\n",
            "java": "public class Main {\n    public static void main(String[] args) {\n        // TODO: Verwende eine for-Schleife, um die Zahlen von 1 bis 10 auszugeben\n    }\n}"
        },
        {
            "chapter_nr": 9,
            "topic": "while loop",
            "content": "<h1 class=\"western\">Kapitel 9 - Die while-Schleife</h1>\n<p>In der Programmierung ist es oft notwendig, einen bestimmten Codeblock wiederholt auszuführen, solange eine bestimmte Bedingung wahr ist. Eine Möglichkeit, dies zu tun, ist die Verwendung einer <b>while-Schleife</b>.</p>\n<p>Die <b>while-Schleife</b> überprüft die Bedingung vor jeder Ausführung des Codeblocks. Solange die Bedingung wahr ist, wird der Code innerhalb der Schleife ausgeführt.</p>\n<p>Hier ist die allgemeine Struktur einer while-Schleife:</p>\n<pre class=\"western\"><code class=\"western\">while (bedingung) {\n    // Code, der wiederholt werden soll\n}</code></pre>\n<p>Hier ist ein einfaches Beispiel, das die Verwendung einer while-Schleife zeigt:</p>\n<pre class=\"western\"><code class=\"western\">int i = 1;\nwhile (i &lt;= 10) {\n    System.out.println(\"Zahl: \" + i);\n    i++;\n}</code></pre>\n<p>In diesem Beispiel wird die Schleife so lange durchlaufen, wie <code>i</code> kleiner oder gleich 10 ist. Bei jedem Durchlauf wird der aktuelle Wert von <code>i</code> ausgegeben und anschließend um 1 erhöht.</p>\n<p>Die while-Schleife ist besonders nützlich, wenn die Anzahl der Wiederholungen nicht im Voraus bekannt ist und von einer Bedingung abhängt.</p>\n<br>",
            "assignment": "<h2>Aufgabe</h2>\n<p>Erstelle ein Programm, das die Zahlen von 10 bis 1 mit einer while-Schleife ausgibt.</p>\n",
            "java": "public class Main {\n    public static void main(String[] args) {\n        // TODO: Verwende eine while-Schleife, um die Zahlen von 10 bis 1 auszugeben\n    }\n}"
        },
        {
            "chapter_nr": 10,
            "topic": "break and continue statements",
            "content": "<h1 class=\"western\">Kapitel 10 - break- und continue-Anweisungen</h1>\n<p>In der Programmierung ist es oft notwendig, die Ausführung von Schleifen zu steuern. Dafür gibt es die <b>break</b> und <b>continue</b> Anweisungen.</p>\n<p>Die <b>break</b> Anweisung wird verwendet, um eine Schleife vorzeitig zu beenden. Wenn der Computer auf eine <b>break</b> Anweisung trifft, wird die Schleife sofort verlassen, und der Code nach der Schleife wird ausgeführt.</p>\n<p>Hier ist ein einfaches Beispiel:</p>\n<pre class=\"western\"><code class=\"western\">for (int i = 0; i &lt; 10; i++) {\n    if (i == 5) {\n        break; // Schleife wird beendet, wenn i gleich 5 ist\n    }\n    System.out.println(i);\n}</code></pre>\n<p>In diesem Beispiel wird die Schleife von 0 bis 9 durchlaufen, aber sie wird beendet, wenn <code>i</code> den Wert 5 erreicht.</p>\n<p>Die <b>continue</b> Anweisung hingegen überspringt die aktuelle Iteration der Schleife und fährt mit der nächsten Iteration fort. Wenn der Computer auf eine <b>continue</b> Anweisung trifft, wird der restliche Code innerhalb der Schleife für diese Iteration übersprungen.</p>\n<p>Hier ist ein Beispiel für die Verwendung von <b>continue</b>:</p>\n<pre class=\"western\"><code class=\"western\">for (int i = 0; i &lt; 10; i++) {\n    if (i % 2 == 0) {\n        continue; // gerade Zahlen werden übersprungen\n    }\n    System.out.println(i);\n}</code></pre>\n<p>In diesem Beispiel werden nur die ungeraden Zahlen von 0 bis 9 ausgegeben, da die geraden Zahlen übersprungen werden. Die Anweisung % entspricht der Modulo-Operation. Sie gibt also den Rest an bei der Division mit Rest.</p>\n<p>Du wirst lernen, wie man diese Anweisungen in deinen Programmen anwendet, um die Kontrolle über Schleifen zu haben.</p>\n<br>",
            "assignment": "<h2>Aufgabe</h2>\n<p>Erstelle ein Programm, das die Zahlen von 1 bis 20 ausgibt, aber die Zahlen 5 und 10 überspringt. Verwende dafür die <b>continue</b> Anweisung. Beende die Schleife, wenn die Zahl 15 erreicht ist, indem du die <b>break</b> Anweisung verwendest.</p>\n",
            "java": "public class Main {\n    public static void main(String[] args) {\n        // TODO: Verwende eine Schleife, um die Zahlen von 1 bis 20 auszugeben\n        // TODO: Überspringe die Zahlen 5 und 10 mit continue\n        // TODO: Beende die Schleife, wenn die Zahl 15 erreicht ist mit break\n    }\n}"
        },
        {
            "chapter_nr": 11,
            "topic": "type casts",
            "content": "<h1 class=\"western\">Kapitel 11 - Typumwandlungen</h1>\n<p>In der Programmierung kann es notwendig sein, den Datentyp einer Variable zu ändern. Dies nennt man <b>Typumwandlung</b> oder <b>Type Casting</b>.</p>\n<p>Es gibt zwei Arten von Typumwandlungen:</p>\n<ul>\n    <li><b>Automatische Typumwandlung:</b> Dies geschieht, wenn der Compiler den Datentyp automatisch anpasst, um einen Ausdruck korrekt auszuführen. Zum Beispiel, wenn du eine <code>int</code> Zahl in eine <code>double</code> Zahl umwandelst, geschieht dies automatisch, da <code>double</code> mehr Informationen speichern kann.</li>\n    <li><b>Manuelle Typumwandlung:</b> Dies geschieht, wenn du explizit angibst, dass du einen Datentyp ändern möchtest. Zum Beispiel, wenn du eine <code>double</code> Zahl in eine <code>int</code> Zahl umwandelst, musst du dies manuell tun, da dabei Informationen verloren gehen können.</li>\n</ul>\n<p>Hier ist ein Beispiel für eine manuelle Typumwandlung:</p>\n<pre class=\"western\"><code class=\"western\">double zahl = 9.78;\nint ganzzahl = (int) zahl; // manuelle Typumwandlung</code></pre>\n<p>In diesem Beispiel wird die <code>double</code> Zahl <code>9.78</code> in eine <code>int</code> Zahl umgewandelt. Der Wert von <code>ganzzahl</code> wird <code>9</code> sein, da die Nachkommastellen abgeschnitten werden.</p>\n<p>Typumwandlungen sind wichtig, um sicherzustellen, dass die Daten in der gewünschten Form vorliegen, bevor sie in Berechnungen oder Ausgaben verwendet werden.</p>\n<br>",
            "assignment": "<h2>Aufgabe</h2>\n<p>Erstelle ein Programm, das eine <code>double</code> Zahl deklariert und diese in eine <code>int</code> Zahl umwandelt. Gib sowohl die ursprüngliche <code>double</code> Zahl als auch die umgewandelte <code>int</code> Zahl aus.</p>\n",
            "java": "public class Main {\n    public static void main(String[] args) {\n        // TODO: Deklariere eine double Zahl\n        // TODO: Wandle die double Zahl in eine int Zahl um\n        // TODO: Gib beide Zahlen aus\n    }\n}"
        },
        {
            "chapter_nr": 12,
            "topic": "runtime errors",
            "content": "<h1 class=\"western\">Kapitel 12 - Laufzeitfehler</h1>\n<p>In der Programmierung können Fehler auftreten, die während der Ausführung eines Programms auftreten. Diese Fehler werden als <b>Laufzeitfehler</b> bezeichnet. Laufzeitfehler können verschiedene Ursachen haben, wie z.B. falsche Eingaben, Division durch Null oder der Zugriff auf nicht vorhandene Elemente in einer Liste.</p>\n<p>Ein häufiges Beispiel für einen Laufzeitfehler ist die Division durch Null. Wenn du versuchst, eine Zahl durch Null zu teilen, wird das Programm mit einer Fehlermeldung abgebrochen. Hier ist ein Beispiel:</p>\n<pre class=\"western\"><code class=\"western\">int a = 10;\nint b = 0;\nint ergebnis = a / b; // Dies führt zu einem Laufzeitfehler</code></pre>\n<p>Um Laufzeitfehler zu vermeiden, ist es wichtig, Eingaben zu validieren und sicherzustellen, dass alle Bedingungen erfüllt sind, bevor du Berechnungen durchführst. Du wirst auch lernen, wie man mit Ausnahmen umgeht, um Laufzeitfehler zu behandeln und das Programm stabiler zu machen.</p>\n<p>In diesem Kapitel wirst du lernen, wie man Laufzeitfehler erkennt und vermeidet, um sicherzustellen, dass dein Programm reibungslos funktioniert.</p>\n<br>",
            "assignment": "<h2>Aufgabe</h2>\n<p>Erstelle ein Programm, das zwei Zahlen vom Benutzer einliest und die Division der ersten Zahl durch die zweite Zahl durchführt. Für das Einlesen einer Zahl vom Benutzer kannst du du folgenden Befehl verwenden:<pre class=\"western\"><code class=\"western\">scanner.nextInt()</code></pre>\n Stelle sicher, dass die zweite Zahl nicht Null ist, bevor du die Division durchführst. Gib eine entsprechende Fehlermeldung aus, wenn die zweite Zahl Null ist.</p>\n<p>Probiere auch mal aus, was passiert, wenn du doch durch Null teilst.</p>\n",
            "java": "import java.util.Scanner;\n\nclass Main {\n    public static void main(String[] args) {\n        Scanner scanner = new Scanner(System.in);\n        // TODO: Lese zwei Zahlen vom Benutzer ein\n        // TODO: Überprüfe, ob die zweite Zahl Null ist\n        // TODO: Führe die Division durch und gib das Ergebnis aus\n    }\n}"
        },
        {
            "chapter_nr": 13,
            "topic": "writing programs that use control flow to make decisions",
            "content": "<h1 class=\"western\">Kapitel 13 - Programme schreiben, die Kontrollfluss verwenden, um Entscheidungen zu treffen</h1>\n<p>In diesem Kapitel werden wir lernen, wie man Programme schreibt, die Entscheidungen basierend auf bestimmten Bedingungen treffen. Dies ist ein grundlegendes Konzept in der Programmierung, das es ermöglicht, den Ablauf eines Programms zu steuern.</p>\n<p>Wir werden die bereits gelernten Konzepte wie <b>if-else</b> Anweisungen und <b>switch-case</b> Strukturen verwenden, um verschiedene Szenarien zu behandeln. Du wirst sehen, wie man Benutzereingaben verarbeitet und darauf basierend unterschiedliche Ausgaben erzeugt.</p>\n<p>Hier ist ein einfaches Beispiel, das zeigt, wie man eine Entscheidung basierend auf einer Benutzereingabe trifft:</p>\n<pre class=\"western\"><code class=\"western\">import java.util.Scanner;\n\nclass Main {\n    public static void main(String[] args) {\n        Scanner scanner = new Scanner(System.in);\n        System.out.print(\"Gib eine Zahl ein: \");\n        int zahl = scanner.nextInt();\n\n        if (zahl > 0) {\n            System.out.println(\"Die Zahl ist positiv.\");\n        } else if (zahl &lt; 0) {\n            System.out.println(\"Die Zahl ist negativ.\");\n        } else {\n            System.out.println(\"Die Zahl ist null.\");\n        }\n    }\n}</code></pre>\n<p>In diesem Beispiel fragt das Programm den Benutzer nach einer Zahl und gibt dann aus, ob die Zahl positiv, negativ oder null ist. Du wirst lernen, wie man solche Logik in deinen eigenen Programmen anwendet.</p>\n<br>",
            "assignment": "<h2>Aufgabe</h2>\n<p>Erstelle ein Programm, das den Benutzer nach seinem Alter fragt und basierend auf dem Alter eine entsprechende Nachricht ausgibt. Wenn der Benutzer unter 18 Jahre alt ist, gib \"Du bist ein Jugendlicher\" aus. Wenn der Benutzer zwischen 18 und 65 Jahren alt ist, gib \"Du bist ein Erwachsener\" aus. Wenn der Benutzer über 65 Jahre alt ist, gib \"Du bist ein Senior\" aus.</p>\n",
            "java": "import java.util.Scanner;\n\nclass Main {\n    public static void main(String[] args) {\n        Scanner scanner = new Scanner(System.in);\n        // TODO: Frage den Benutzer nach seinem Alter\n        // TODO: Verwende if-else Anweisungen, um die entsprechende Nachricht auszugeben\n    }\n}"
        },
        {
            "chapter_nr": 14,
            "topic": "arrays - declaring, initializing, and accessing array elements",
            "content": "<h1 class=\"western\">Kapitel 14 - Arrays: Deklaration, Initialisierung und Zugriff auf Elemente</h1>\n<p>In der Programmierung ist es oft notwendig, mehrere Werte des gleichen Datentyps zu speichern. Eine Möglichkeit, dies zu tun, ist die Verwendung von <b>Arrays</b>.</p>\n<p>Ein <b>Array</b> ist eine Sammlung von Werten, die unter einem gemeinsamen Namen gespeichert sind. Jedes Element im Array hat einen Index, der angibt, an welcher Position es sich im Array befindet. Der Index beginnt bei 0.</p>\n<p>Hier ist ein einfaches Beispiel, wie man ein Array in Java deklariert und initialisiert:</p>\n<pre class=\"western\"><code class=\"western\">int[] zahlen = new int[5]; // Deklaration eines Arrays mit 5 Elementen</code></pre>\n<p>In diesem Beispiel haben wir ein Array mit dem Namen <code>zahlen</code> deklariert, das Platz für 5 ganze Zahlen bietet. Um Werte in das Array einzufügen, können wir die Indizes verwenden:</p>\n<pre class=\"western\"><code class=\"western\">zahlen[0] = 10; // Erstes Element\nzahlen[1] = 20; // Zweites Element\nzahlen[2] = 30; // Drittes Element\nzahlen[3] = 40; // Viertes Element\nzahlen[4] = 50; // Fünftes Element</code></pre>\n<p>Um auf die Werte im Array zuzugreifen, verwenden wir ebenfalls die Indizes:</p>\n<pre class=\"western\"><code class=\"western\">System.out.println(zahlen[0]); // Gibt 10 aus</code></pre>\n<p>In diesem Kapitel wirst du lernen, wie man Arrays deklariert, initialisiert und auf ihre Elemente zugreift.</p>\n<br>",
            "assignment": "<h2>Aufgabe</h2>\n<p>Erstelle ein Programm, das ein Array von 5 ganzen Zahlen deklariert, diese initialisiert und anschließend die Werte des Arrays in der Konsole ausgibt.</p>\n",
            "java": "public class Main {\n    public static void main(String[] args) {\n        // TODO: Deklariere und initialisiere ein Array von 5 ganzen Zahlen\n        // TODO: Gib die Werte des Arrays in der Konsole aus.\n    }\n}"
        },
        {
            "chapter_nr": 15,
            "topic": "using loops to manipulate arrays",
            "content": "<h1 class=\"western\">Kapitel 15 - Schleifen zur Manipulation von Arrays</h1>\n<p>In diesem Kapitel werden wir lernen, wie man Schleifen verwendet, um mit Arrays zu arbeiten. Arrays sind eine Möglichkeit, mehrere Werte des gleichen Datentyps zu speichern, und Schleifen ermöglichen es uns, diese Werte effizient zu verarbeiten.</p>\n<p>Wir werden die <b>for-Schleife</b> und die <b>while-Schleife</b> verwenden, um durch die Elemente eines Arrays zu iterieren. Außerdem werden wir lernen, wie man die Werte in einem Array ändern kann.</p>\n<p>Hier ist ein einfaches Beispiel, das zeigt, wie man mit einer for-Schleife durch ein Array iteriert:</p>\n<pre class=\"western\"><code class=\"western\">int[] zahlen = {1, 2, 3, 4, 5};\n\nfor (int i = 0; i &lt; zahlen.length; i++) {\n    System.out.println(zahlen[i]);\n}</code></pre>\n<p>In diesem Beispiel haben wir ein Array mit den Werten 1 bis 5 deklariert und mit einer for-Schleife durch das Array iteriert, um jeden Wert auszugeben.</p>\n<p>Wir können auch die Werte in einem Array ändern. Hier ist ein Beispiel:</p>\n<pre class=\"western\"><code class=\"western\">zahlen[0] = 10; // Ändert den ersten Wert im Array auf 10</code></pre>\n<p>In diesem Kapitel wirst du lernen, wie man Schleifen verwendet, um Arrays zu manipulieren und die Werte in ihnen zu ändern.</p>\n<br>",
            "assignment": "<h2>Aufgabe</h2>\n<p>Erstelle ein Programm, das ein Array von 5 ganzen Zahlen deklariert, diese mit Werten initialisiert und dann die Werte verdoppelt. Gib die ursprünglichen und die verdoppelten Werte in der Konsole aus. Verwende eine for-Schleife zur Verdoppelung und Ausgabe der Werte des Arrays.</p>\n",
            "java": "public class Main {\n    public static void main(String[] args) {\n        // TODO: Deklariere und initialisiere ein Array von 5 ganzen Zahlen\n        // TODO: Verwende eine Schleife, um die Werte im Array zu verdoppeln und die ursprünlichen und verdoppelten Werte auszugeben.\n    }\n}"
        },
        {
            "chapter_nr": 16,
            "topic": "multidimensional arrays",
            "content": "<h1 class=\"western\">Kapitel 16 - Mehrdimensionale Arrays</h1>\n<p>In der Programmierung kann es notwendig sein, Daten in mehreren Dimensionen zu speichern. Dies geschieht durch die Verwendung von <b>mehrdimensionalen Arrays</b>.</p>\n<p>Ein mehrdimensionales Array ist ein Array, das Arrays als Elemente enthält. Das häufigste Beispiel ist das <b>zweidimensionale Array</b>, das oft als Tabelle oder Matrix dargestellt wird.</p>\n<p>Hier ist ein einfaches Beispiel für die Deklaration und Initialisierung eines zweidimensionalen Arrays:</p>\n<pre class=\"western\"><code class=\"western\">int[][] matrix = new int[3][3]; // Deklaration eines 3x3 Arrays</code></pre>\n<p>In diesem Beispiel haben wir ein zweidimensionales Array mit dem Namen <code>matrix</code> deklariert, das Platz für 3 Zeilen und 3 Spalten bietet. Um Werte in das Array einzufügen, können wir die Indizes verwenden:</p>\n<pre class=\"western\"><code class=\"western\">matrix[0][0] = 1; // Erstes Element\nmatrix[0][1] = 2; // Zweites Element\nmatrix[1][0] = 3; // Drittes Element\n</code></pre>\n<p>Um auf die Werte im mehrdimensionalen Array zuzugreifen, verwenden wir ebenfalls die Indizes:</p>\n<pre class=\"western\"><code class=\"western\">System.out.println(matrix[0][0]); // Gibt 1 aus</code></pre>\n<p>In diesem Kapitel wirst du lernen, wie man mehrdimensionale Arrays deklariert, initialisiert und auf ihre Elemente zugreift.</p>\n<br>",
            "assignment": "<h2>Aufgabe</h2>\n<p>Erstelle ein Programm, das ein zweidimensionales Array von 3x3 deklariert, es mit Werten initialisiert und anschließend die Werte des Arrays in der Konsole ausgibt. Verwende zur Ausgabe der Werte zwei verschachtelte for-Schleifen.</p>\n",
            "java": "public class Main {\n    public static void main(String[] args) {\n        // TODO: Deklariere und initialisiere ein zweidimensionales Array von 3x3\n        // TODO: Gib die Werte des Arrays in der Konsole aus. Verwnde dazu zwei verschachtelte for-Schleifen.\n    }\n}"
        },
        {
            "chapter_nr": 17,
            "topic": "methods in Java (without parameters and return values) - declaration and calling",
            "content": "<h1 class=\"western\">Kapitel 17 - Methoden in Java (ohne Parameter und Rückgabewerte)</h1>\n<p>In der Programmierung ist es wichtig, Code in wiederverwendbare Teile zu organisieren. Eine Möglichkeit, dies zu tun, ist die Verwendung von <b>Methoden</b>.</p>\n<p>Eine Methode ist ein Block von Code, der eine bestimmte Aufgabe ausführt. Du kannst eine Methode deklarieren und sie dann in deinem Programm aufrufen, um die darin enthaltenen Anweisungen auszuführen.</p>\n<p>Hier ist ein einfaches Beispiel für die Deklaration und den Aufruf einer Methode:</p>\n<pre class=\"western\"><code class=\"western\">public class Main {\n    public static void main(String[] args) {\n        meineMethode(); // Aufruf der Methode\n    }\n\n    public static void meineMethode() {\n        System.out.println(\"Hallo von meiner Methode!\");\n    }\n}</code></pre>\n<p>In diesem Beispiel haben wir eine Methode namens <code>meineMethode</code> deklariert, die eine Nachricht ausgibt. Wir rufen diese Methode in der <code>main</code> Methode auf, um die Nachricht anzuzeigen.</p>\n<p>Methoden helfen, den Code zu strukturieren und wiederverwendbar zu machen. Du wirst lernen, wie man Methoden in deinen Programmen verwendet, um die Lesbarkeit und Wartbarkeit zu verbessern.</p>\n<br>",
            "assignment": "<h2>Aufgabe</h2>\n<p>Erstelle ein Programm, das eine Methode deklariert, die eine einfache Nachricht ausgibt. Rufe diese Methode in der <code>main</code> Methode drei mal auf.</p>\n",
            "java": "public class Main {\n    public static void main(String[] args) {\n        // TODO: Rufe deine Methode drei mal auf\n    }\n\n    //TODO: Deklariere und erstelle deine Methode, die einen einfachen Text ausgibt.\n}"
        },
        {
            "chapter_nr": 18,
            "topic": "methods with parameters",
            "content": "<h1 class=\"western\">Kapitel 18 - Methoden mit Parametern</h1>\n<p>In der Programmierung ist es oft notwendig, Informationen an Methoden zu übergeben, damit sie ihre Aufgaben ausführen können. Dies geschieht durch die Verwendung von <b>Parametern</b>.</p>\n<p>Ein Parameter ist eine Variable, die in der Methodendeklaration definiert wird und die Werte erhält, die beim Aufruf der Methode übergeben werden. Hier ist ein einfaches Beispiel:</p>\n<pre class=\"western\"><code class=\"western\">public class Main {\n    public static void main(String[] args) {\n        begruessung(\"Max\"); // Aufruf der Methode mit dem Parameter \"Max\"\n    }\n\n    public static void begruessung(String name) {\n        System.out.println(\"Hallo, \" + name + \"!\");\n    }\n}</code></pre>\n<p>In diesem Beispiel haben wir eine Methode namens <code>begruessung</code> deklariert, die einen Parameter <code>name</code> vom Typ <code>String</code> erwartet. Wenn wir die Methode aufrufen und den Namen \"Max\" übergeben, wird die Ausgabe \"Hallo, Max!\" sein.</p>\n<p>Durch die Verwendung von Parametern kannst du Methoden flexibler gestalten und sie für verschiedene Eingaben verwenden. In diesem Kapitel wirst du lernen, wie man Methoden mit Parametern deklariert und aufruft.</p>\n<br>",
            "assignment": "<h2>Aufgabe</h2>\n<p>Erstelle ein Programm, das eine Methode deklariert, die zwei Zahlen als Parameter entgegennimmt und deren Summe ausgibt. Rufe diese Methode in der <code>main</code> Methode mit verschiedenen Zahlen auf.</p>\n",
            "java": "public class Main {\n    public static void main(String[] args) {\n        // TODO: Rufe deine Methode mit verschiedenen Zahlen auf\n    }\n\n    //TODO: Deklariere und erstelle deine Methode, die zwei Zahlen als Parameter entgegennimmt und deren Summe ausgibt.\n}"
        },
        {
            "chapter_nr": 19,
            "topic": "methods and return types",
            "content": "<h1 class=\"western\">Kapitel 19 - Methoden und Rückgabetypen</h1>\n<p>In der Programmierung ist es oft notwendig, dass eine Methode nicht nur eine Aufgabe ausführt, sondern auch ein Ergebnis zurückgibt. Dies geschieht durch die Verwendung von <b>Rückgabetypen</b>.</p>\n<p>Ein Rückgabetyp ist der Datentyp des Wertes, den eine Methode zurückgibt. Wenn eine Methode einen Wert zurückgibt, muss der Rückgabetyp in der Methodendeklaration angegeben werden. Hier ist ein einfaches Beispiel:</p>\n<pre class=\"western\"><code class=\"western\">public class Main {\n    public static void main(String[] args) {\n        int ergebnis = addiere(5, 3); // Aufruf der Methode und Speichern des Ergebnisses\n        System.out.println(\"Das Ergebnis ist: \" + ergebnis);\n    }\n\n    public static int addiere(int a, int b) {\n        return a + b; // Rückgabe der Summe\n    }\n}</code></pre>\n<p>In diesem Beispiel haben wir eine Methode namens <code>addiere</code> deklariert, die zwei <code>int</code> Werte als Parameter entgegennimmt und deren Summe zurückgibt. Der Rückgabetyp der Methode ist <code>int</code>, was bedeutet, dass sie einen ganzzahligen Wert zurückgibt.</p>\n<p>Durch die Verwendung von Rückgabetypen kannst du Methoden erstellen, die Ergebnisse liefern, die in anderen Teilen deines Programms verwendet werden können. In diesem Kapitel wirst du lernen, wie man Methoden mit Rückgabetypen deklariert und aufruft.</p>\n<br>",
            "assignment": "<h2>Aufgabe</h2>\n<p>Erstelle ein Programm, das eine Methode deklariert, die den Quadratwert einer Zahl berechnet und zurückgibt. Rufe diese Methode in der <code>main</code> Methode auf und gib das Ergebnis aus.</p>\n",
            "java": "public class Main {\n    public static void main(String[] args) {\n        // TODO: Rufe deine Methode auf und gib das Ergebnis aus\n    }\n\n    //TODO: Deklariere und erstelle deine Methode, die den Quadratwert einer Zahl berechnet und zurückgibt.\n}"
        },
        {
            "chapter_nr": 20,
            "topic": "object oriented programming - concept of a class (defining and creating objects - the new keyword)",
            "content": "<h1 class=\"western\">Kapitel 20 - Objektorientierte Programmierung: Das Konzept einer Klasse</h1>\n<p>In der objektorientierten Programmierung (OOP) ist eine <b>Klasse</b> ein grundlegendes Konzept, das es ermöglicht, Objekte zu definieren und zu erstellen. Eine Klasse ist wie eine Blaupause oder ein Bauplan für ein Objekt. Sie beschreibt, welche Eigenschaften (Attribute) und Verhaltensweisen (Methoden -> nächstes Kapitel) die Objekte dieser Klasse haben. Es wird häufig verwendet um verschiedene Attribute (und Methoden) zu kapseln (zu vereinen) und um Code wiederverwenden zu können.</p>\n<p>Um eine Klasse zu definieren, verwendest du das Schlüsselwort <b>class</b>, gefolgt vom Namen der Klasse. Hier ist ein einfaches Beispiel:</p>\n<pre class=\"western\"><code class=\"western\">class Auto {\n    String farbe;\n    int baujahr;\n}</code></pre>\n<p>In diesem Beispiel haben wir eine Klasse namens <code>Auto</code> definiert. Diese Klasse hat zwei Attribute: <code>farbe</code> und <code>baujahr</code>.</p> <p>Man nennt die Attribute einer Klasse auch <b>Instanzvariablen</b>.</p>\n<p>Um ein Objekt dieser Klasse zu erstellen, verwendest du das Schlüsselwort <b>new</b>. Hier ist ein Beispiel:</p>\n<pre class=\"western\"><code class=\"western\">Auto meinAuto = new Auto();</code></pre>\n<p>\n<p>In diesem Beispiel haben wir ein Objekt namens <code>meinAuto</code> erstellt, das eine Instanz der Klasse <code>Auto</code> ist. Jetzt können wir die Attribute und Methoden dieses Objekts verwenden.</p>\n<p>Hier ist ein Beispiel wie du im weiteren Verlauf auf das Objekt, bzw. auf die einzelnen Attribute zugreifen kannst:</p>\n<pre class=\"western\"><code class=\"western\">meinAuto.farbe = \"gelb\";\nmeinAuto.alter = 8;\nSystem.out.println(\"Mein Auto ist \" + meinAuto.farbe + \n\" und ist \" + meinAuto.alter + \" Jahre alt.\");</code></pre>\n<p>In diesem Kapitel wirst du lernen, wie man Klassen definiert, Objekte erstellt und die grundlegenden Konzepte der objektorientierten Programmierung anwendet.</p>\n<br>",
            "assignment": "<h2>Aufgabe</h2>\n<p>Erstelle eine Klasse namens <code>Person</code>, die die Attribute <code>name</code> (String) und <code>alter</code> (int) hat. Erstelle dann ein Objekt der Klasse <code>Person</code> und gib den Attributen entsprechende Werte. Gib anschließend die Werte der Attribute auf der Konsole aus.</p>\n</p>",
            "java": "// TODO: Erstelle eine Klasse mit dem Namen Person mit den Attributen name und alter.\n\n\npublic class Main {\n    public static void main(String[] args) {\n        // TODO: Erstelle ein Objekt der Klasse Person, setze die Attribute und gib sie auf der Konsole aus.\n    }\n}"
        },
        {
            "chapter_nr": 21,
            "topic": "defining methods in a class",
            "content": "<h1 class=\"western\">Kapitel 21 - Methoden in einer Klasse definieren und verwenden</h1>\n<p>In diesem Kapitel werden wir lernen, wie man Methoden innerhalb einer Klasse definiert und wie man diese Methoden von einem Objekt der Klasse aufruft.</p>\n<p>Eine Methode ist ein Block von Code, der eine bestimmte Aufgabe ausführt. Wenn du eine Methode in einer Klasse definierst, kannst du sie aufrufen, um die darin enthaltenen Anweisungen auszuführen.</p>\n<p>Hier ist ein einfaches Beispiel:</p>\n<pre class=\"western\"><code class=\"western\">class Auto {\n    String farbe;\n\n    void fahren() {\n        System.out.println(\"Das Auto fährt.\");\n    }\n}\n\npublic class Main {\n    public static void main(String[] args) {\n        Auto meinAuto = new Auto();\n        meinAuto.fahren(); // Aufruf der Methode fahren()\n    }\n}</code></pre>\n<p>In diesem Beispiel haben wir eine Methode namens <code>fahren</code> in der Klasse <code>Auto</code> definiert. Wir erstellen ein Objekt <code>meinAuto</code> und rufen die Methode <code>fahren</code> auf, um die Nachricht anzuzeigen.</p>\n<p>Du wirst lernen, wie man Methoden in deinen Klassen definiert und wie man sie von Objekten aufruft, um die Funktionalität deiner Programme zu erweitern.</p>\n<br>",
            "assignment": "<h2>Aufgabe</h2>\n<p>Erstelle eine Klasse namens <code>Rechner</code>, die eine Methode <code>addiere</code> hat, die zwei Zahlen als Parameter entgegennimmt und deren Summe zurückgibt. Erstelle dann ein Objekt der Klasse <code>Rechner</code> in der <code>main</code> Methode und rufe die <code>addiere</code> Methode auf, um die Summe von zwei Zahlen zu berechnen und auszugeben.</p>\n",
            "java": "class Rechner {\n    // TODO: Definiere die Methode addiere, die zwei Zahlen addiert und zurückgibt\n}\n\npublic class Main {\n    public static void main(String[] args) {\n        // TODO: Erstelle ein Objekt der Klasse Rechner und rufe die addiere Methode auf\n    }\n}"
        },
        {
            "chapter_nr": 22,
            "topic": "constructors",
            "content": "<h1 class=\"western\">Kapitel 22 - Konstruktoren</h1>\n<p>In der objektorientierten Programmierung ist ein <b>Konstruktor</b> eine spezielle Methode, die aufgerufen wird, wenn ein neues Objekt einer Klasse erstellt wird. Der Konstruktor hat den gleichen Namen wie die Klasse und hat keinen Rückgabetyp.</p>\n<p>Der Hauptzweck eines Konstruktors ist es, die Instanzvariablen eines Objekts zu initialisieren. Hier ist ein einfaches Beispiel:</p>\n<pre class=\"western\"><code class=\"western\">class Auto {\n    String farbe;\n    int baujahr;\n\n    // Konstruktor\n    public Auto(String farbe, int baujahr) {\n        this.farbe = farbe;\n        this.baujahr = baujahr;\n    }\n}</code></pre>\n<p>In diesem Beispiel haben wir einen Konstruktor für die Klasse <code>Auto</code> definiert, der zwei Parameter <code>farbe</code> und <code>baujahr</code> entgegennimmt. Mit dem Schlüsselwort <code>this</code> können wir auf die Instanzvariablen der Klasse zugreifen und sie mit den Werten der Parameter initialisieren.</p>\n<p>Wenn wir ein neues Auto-Objekt erstellen, können wir den Konstruktor verwenden, um die Werte für die Instanzvariablen festzulegen:</p>\n<pre class=\"western\"><code class=\"western\">Auto meinAuto = new Auto(\"Rot\", 2020);</code></pre>\n<p>In diesem Kapitel wirst du lernen, wie man Konstruktoren verwendet, um Objekte zu initialisieren und den Code übersichtlicher zu gestalten.</p>\n<br>",
            "assignment": "<h2>Aufgabe</h2>\n<p>Erstelle eine Klasse namens <code>Person</code>, die die Instanzvariablen <code>name</code> (String) und <code>alter</code> (int) und eine Methode <code>vorstellen</code> hat. Füge einen Konstruktor hinzu, der die Variablen initialisiert. Erstelle dann ein Objekt der Klasse <code>Person</code> in der <code>main</code> Methode und gib die Werte der Instanzvariablen mit Hilfe der <code>vorstellen</code> Methode aus.</p>\n",
            "java": "// TODO: Erstelle eine Klasse Person mit den geforderten Attributen und Methode.\n\npublic class Main {\n    public static void main(String[] args) {\n        // TODO: Erstelle ein Objekt der Klasse Person und gib die Werte der Instanzvariablen aus\n    }\n}"
        },
        {
            "chapter_nr": 23,
            "topic": "inheritance - the extends keyword and class hierarchies",
            "content": "<h1 class=\"western\">\nKapitel 23 - Vererbung</h1>\n<p>Wir haben schon festgestellt, dass\nein wichtiges Konzept der OOP die Wiederverwendbarkeit von Code\nist.<br/>\nHäufig kommt es vor, dass man zwei verschiedene Klassen\nbenötigt, die sich nur in kleinen Teilen unterscheiden.\n</p>\n<p>Damit sich Code nicht in zwei (oder\nmehr) Klassen wiederholt, erstellt man eine Basis-Klasse, die alle\ngemeinsamen Elemente enthält. Die benötigten Klassen sind dann\nKopien dieser Basis-Klasse, erweitert um die jeweiligen\n(unterschiedlichen) Eigenschaften.</p>\n<p>Die Basis-Klasse nennt man die\n<b>Elter-Klasse</b> und die abgeleiteten Klassen heißen\n<b>Kind-Klassen</b>. Die Eigenschaften der Elter-Klasse werden auf\ndie Kind-Klassen <b>vererbt</b>.</p>\n<p>Um anzuzeigen, dass eine Klasse von\neiner anderen Klasse erbt, verwendet man das Keywort <b>extends</b>.</p>\n<p>Im folgenden Beispiel sind die\nKlassen <i>Auto</i> und <i>Motorrad</i> Kind-Klassen von der Klasse <i>Fahrzeug</i>:\n</p>\n<pre class=\"western\">class Fahrzeug {\n<code class=\"western\">   </code>public String art = &quot;Kraftfahrzeug&quot;;  // Attribut von Fahrzeug\n<code class=\"western\">   </code>public void hupen() {                 // Methode von Fahrzeug\n<code class=\"western\">     </code>System.out.println(&quot;Tuut, tuut!&quot;);\n<code class=\"western\">   </code>}\n}\n\n\nclass Auto extends Fahrzeug {\n<code class=\"western\">   </code>public int anzahlRaeder = 4;     // Attribut von Auto\n}\n\nclass Motorrad extends Fahrzeug {\n<code class=\"western\">   </code>public int anzahlRaeder = 2;     // Attribut von Motorrad\n}\n\nclass main{\n<code class=\"western\">   </code>public static void main(String[] args) {\n<code class=\"western\">     </code>// Deklaration von einem Auto und einem Motorrad\n<code class=\"western\">     </code>Auto meinAuto = new Auto();\n<code class=\"western\">     </code>Motorrad meinRad = new Motorrad();\n\n<code class=\"western\">     </code>// Aufrufen der hupen() Methode (von der Fahrzeug Klasse)\n<code class=\"western\">     </code>meinAuto.hupen();\n<code class=\"western\">     </code>meinRad.hupen();\n\n<code class=\"western\">     </code>// Anzeigen der Attribute Art und der Anzahl Räder\n<code class=\"western\">     </code>System.out.print(&quot;Art: &quot; + meinAuto.art);\n<code class=\"western\">     </code>System.out.println(&quot;, Anzahl Räder: &quot; + meinAuto.anzahlRaeder);\n<code class=\"western\">     </code>System.out.print(&quot;Art: &quot; + meinRad.art);\n<code class=\"western\">     </code>System.out.println(&quot;, Anzahl Räder: &quot; + meinRad.anzahlRaeder);\n<code class=\"western\">   </code>}\n}\n</pre>\n<p>Die Ausführung dieses Programms ergibt folgenden Output:</p>\n<pre class=\"western\">Tuut, tuut!\nTuut, tuut!\nArt: Kraftfahrzeug, Anzahl Räder: 4\nArt: Kraftfahrzeug, Anzahl Räder: 2</pre>\n<p>Die Klassen <i>Auto</i> und <i>Motorrad</i> besitzen\nbeide auch das Attribut <i>art</i> und die Methode <i>hupen().</i></p>\n<p>\n<br>",
            "assignment": "<h2>Aufgabe</h2>\n    <p>Erstelle ein Programm, das die Vererbung zwischen verschiedenen Tierarten demonstriert und dabei die\n\t\tBesonderheiten der Tiere hervorhebt. Du kannst das Programm erweitern, um\n\t\tauch andere Tiere wie Vögel oder Fische einzubeziehen.</p>\n\t<p>Erstelle eine Basis-Klasse Tier, die allgemeine Eigenschaften und Methoden für Tiere definiert.</p>\n\t<p>Erstelle dann zwei spezialisierte Klassen, Hund und Katze, die von der Klasse Tier erben.</p>\n\t<p>Die Klassen sollen folgende Anforderungen erfüllen:</p>\n\t<p>Basis-Klasse Tier:</p>\n\t<ul>\n\t\t<li>Attribut: name (String) - Der Name des Tieres.</li>\n\t\t<li>Attribut: gewicht (double) - Das Gewicht des Tieres.</li>\n\t</ul>\n\t<p>Klasse Hund:</p>\n\t<ul>\n\t\t<li>Erbt von der Klasse Tier.</li>\n\t\t<li>Methode: geraeuschMachen() - Gibt &quot;Hund bellt: Wuff, Wuff!&quot; aus.</li>\n\t\t<li>Methode: apportieren() - Gibt &quot;Hund apportiert den Ball!&quot; aus.</li>\n\t</ul>\n\t<p>Klasse Katze:</p>\n\t<ul>\n\t\t<li>Erbt von der Klasse Tier.</li>\n\t\t<li>Methode: geraeuschMachen() - Gibt &quot;Katze miaut: Miau, Miau!&quot; aus.</li>\n\t\t<li>Methode: kratzen() - Gibt &quot;Katze kratzt das Sofa!&quot; aus.</li>\n\t</ul>\n\t<p>main-Klasse:</p>\n\t<ul>\n\t\t<li>Erstelle in der main-Methode ein Objekt von der Klasse Hund und eines von der Klasse Katze.</li>\n\t\t<li>Rufe die Methode geraeuschMachen() für beide Objekte auf.</li>\n\t\t<li>Rufe die Methoden apportieren() und kratzen() für die entsprechenden Objekte auf.</li>\n\t\t<li>Gib die Attribute name und gewicht für beide Objekte aus.</li>\n\t\t<li>Zusätzlich: Überlege dir, welche besonderen Eigenschaften oder Verhaltensweisen du für andere Tiere\n\t\t\thinzufügen könntest, und implementiere diese als neue Klassen.</li>\n\t</ul>\n",
            "java": "// Basis-Klasse Tier\nclass Tier {\n    todo ...\n}\n\n// Spezialisierte Klasse Hund, erbt von Tier\nclass Hund extends Tier {\n    todo ...\n}\n\n// Spezialisierte Klasse Katze, erbt von Tier\nclass Katze extends Tier {\n\n    // Konstruktor\n    public Katze(String name, double gewicht) {\n        super(name, gewicht);\n    }\n\n    todo ...\n\n}\n\n// Main-Klasse zum Testen\npublic class Main {\n    public static void main(String[] args) {\n        todo ...\n    }\n}\n"
        },
        {
            "chapter_nr": 24,
            "topic": "method overriding and polymorphism",
            "content": "<h1 class=\"western\">Kapitel 24 - Methodenüberschreibung und Polymorphismus</h1>\n<p>In der objektorientierten Programmierung ist es oft notwendig, dass eine abgeleitete Klasse die Implementierung einer Methode der Basisklasse anpasst oder ersetzt. Dies nennt man <b>Methodenüberschreibung</b>.</p>\n<p>Wenn eine Methode in einer abgeleiteten Klasse die gleiche Signatur (also den gleichen Namen, den gleichen Rückgabetyp und die gleichen Parameter) wie eine Methode in der Basisklasse hat, wird die Methode der Basisklasse überschrieben. Hier ist ein einfaches Beispiel:</p>\n<pre class=\"western\"><code class=\"western\">class Tier {\n    void geraeuschMachen() {\n        System.out.println(\"Das Tier macht ein Geräusch.\");\n    }\n}\n\nclass Hund extends Tier {\n    void geraeuschMachen() {\n        System.out.println(\"Hund bellt: Wuff, Wuff!\");\n    }\n}\n\npublic class Main {\n    public static void main(String[] args) {\n        Tier meinTier = new Hund();\n        meinTier.geraeuschMachen(); // Gibt \"Hund bellt: Wuff, Wuff!\" aus\n    }\n}</code></pre>\n<p>In diesem Beispiel haben wir eine Methode <code>geraeuschMachen</code> in der Klasse <code>Tier</code> definiert und sie in der Klasse <code>Hund</code> überschrieben. Wenn wir die Methode aufrufen, wird die Implementierung der abgeleiteten Klasse verwendet.</p>\n<p>Polymorphismus ist ein weiteres wichtiges Konzept in der OOP. Es ermöglicht, dass ein Objekt einer abgeleiteten Klasse als Objekt der Basisklasse behandelt wird. Dies ist nützlich, wenn du mit einer Sammlung von Objekten arbeitest, die von einer gemeinsamen Basisklasse abgeleitet sind.</p>\n<p>In diesem Kapitel wirst du lernen, wie man Methodenüberschreibung und Polymorphismus in deinen Programmen anwendet, um flexibler und wiederverwendbarer Code zu schreiben.</p>\n<br>",
            "assignment": "<h2>Aufgabe</h2>\n<p>Erstelle eine Basisklasse <code>Fahrzeug</code> mit einer Methode <code>fahren</code>, die eine allgemeine Nachricht ausgibt. Erstelle dann zwei abgeleitete Klassen <code>Auto</code> und <code>Motorrad</code>, die die Methode <code>fahren</code> überschreiben und spezifische Nachrichten ausgeben. Erstelle in der <code>main</code> Methode ein Objekt jeder Klasse und rufe die <code>fahren</code> Methode auf.</p>\n",
            "java": "class Fahrzeug {\n    todo ...\n}\n\nclass Auto extends Fahrzeug {\n    todo ...\n}\n\nclass Motorrad extends Fahrzeug {\n    todo ...\n}\n\npublic class Main {\n    public static void main(String[] args) {\n        // TODO: Erstelle ein Objekt von Auto und Motorrad und rufe die fahren Methode auf\n    }\n}"
        },
        {
            "chapter_nr": 25,
            "topic": "the super keyword",
            "content": "<h1 class=\"western\">Kapitel 25 - Das super Schlüsselwort</h1>\n<p>In der objektorientierten Programmierung ist das <b>super</b> Schlüsselwort ein wichtiges Konzept, das es dir ermöglicht, auf die Eigenschaften und Methoden der übergeordneten Klasse (Elternklasse) zuzugreifen. Dies ist besonders nützlich, wenn du eine Methode oder ein Attribut in der abgeleiteten Klasse überschreibst und dennoch auf die ursprüngliche Implementierung in der Elternklasse zugreifen möchtest.</p>\n<p>Hier ist ein einfaches Beispiel:</p>\n<pre class=\"western\"><code class=\"western\">class Tier {\n    void geraeuschMachen() {\n        System.out.println(\"Das Tier macht ein Geräusch.\");\n    }\n}\n\nclass Hund extends Tier {\n    void geraeuschMachen() {\n        super.geraeuschMachen(); // Aufruf der Methode der Elternklasse\n        System.out.println(\"Hund bellt: Wuff, Wuff!\");\n    }\n}\n\npublic class Main {\n    public static void main(String[] args) {\n        Hund meinHund = new Hund();\n        meinHund.geraeuschMachen(); // Gibt beide Nachrichten aus\n    }\n}</code></pre>\n<p>In diesem Beispiel haben wir die Methode <code>geraeuschMachen</code> in der Klasse <code>Hund</code> überschrieben. Mit <code>super.geraeuschMachen()</code> rufen wir die Methode der Elternklasse auf, bevor wir die spezifische Nachricht für den Hund ausgeben.</p>\n<p>Das <b>super</b> Schlüsselwort kann auch verwendet werden, um auf Konstruktoren der Elternklasse zuzugreifen. Hier ist ein Beispiel:</p>\n<pre class=\"western\"><code class=\"western\">class Tier {\n    String name;\n\n    public Tier(String name) {\n        this.name = name;\n    }\n}\n\nclass Hund extends Tier {\n    public Hund(String name) {\n        super(name); // Aufruf des Konstruktors der Elternklasse\n    }\n}\n}</code></pre>\n<p>In diesem Kapitel wirst du lernen, wie man das <b>super</b> Schlüsselwort verwendet, um die Funktionalität deiner Klassen zu erweitern und den Code klarer und wartbarer zu gestalten.</p>\n<br>",
            "assignment": "<h2>Aufgabe</h2>\n<p>Erstelle eine Klasse <code>Fahrzeug</code> mit einem Attribut <code>geschwindigkeit</code> und einer Methode <code>fahren</code>, die die Geschwindigkeit ausgibt. Erstelle dann eine Klasse <code>Auto</code>, die von <code>Fahrzeug</code> erbt und einen Konstruktor hat, der die Geschwindigkeit über das <code>super</code> Schlüsselwort initialisiert. Rufe die Methode <code>fahren</code> in der <code>main</code> Methode auf.</p>\n",
            "java": "todo ..."
        }
    ],
    "html_head": "<!DOCTYPE html>\n<html>\n<head>\n    <meta charset=\"UTF-8\">\n    <title>Learn Java</title>\n    <style type=\"text/css\">\n        p { \n            line-height: 100%; \n            margin-bottom: 0.01in; \n            background: transparent; \n            font-family: \"Liberation Serif\", serif; \n            font-size: fsize; \n        }\n        h1 { \n            margin-bottom: 0.08in; \n            background: transparent; \n            page-break-after: avoid; \n            font-family: \"Liberation Serif\", serif; \n            font-weight: bold;\n        }\n        h2 { \n            margin-top: 0.14in; \n            margin-bottom: 0.08in; \n            background: transparent; \n            page-break-after: avoid; \n            font-family: \"Liberation Serif\", serif; \n            font-weight: bold; \n        }\n        pre { \n            margin-top: 0.01in; \n            margin-bottom: 0.01in; \n            background: #cccccc; \n            font-size: fsize; \n            font-family: \"Liberation Mono\", monospace;\n        }\n        code { \n            font-family: \"Liberation Mono\", monospace;\n        }\n        ul, ol { \n            font-family: \"Liberation Serif\", serif; \n            font-size: fsize; \n            line-height: 100%; \n            margin-bottom: 0.01in; \n        }\n        li { \n            font-family: \"Liberation Serif\", serif; \n            font-size: fsize; \n            line-height: 100%; \n            margin-bottom: 0.01in; \n        }\n    </style>\n</head>\n<body lang=\"de-DE\">\n",
    "html_tail": "</body>\n</html>\n"
}
