{
    "florian": {
        "password_hash": "$2b$12$9F9gmHRFlDsplQsDhYKaXOeSR2cg0RCqWLZ5X85WO4JgdhmEDHJ1C",
        "assignment_chapter": 0,
        "current_chapter": 1,
        "preferences": {
            "set": false,
            "favorite_subjects": "",
            "hobbies": "",
            "profession": "",
            "other": ""
        },
        "data": [
            {
                "chapter_nr": 1,
                "assignment": "<h2>Aufgabe</h2>\n<p>Ändere das Programm so ab, dass es nicht mehr \"Hallo Welt\", sondern \"Hello World\" ausgibt.</p>\n",
                "java": "public class Main {\n    public static void main(String[] args) {\n        System.out.println(\"Hallo Welt!\");\n    }\n}"
            },
            {
                "chapter_nr": 2,
                "assignment": "<h2>Aufgabe</h2>\n<p>Füge deinem Programm Kommentare hinzu, um zu erklären, was jeder Teil des Codes macht. Erstelle sowohl einzeilige als auch mehrzeilige Kommentare.</p>\n",
                "java": "public class Main {\n    public static void main(String[] args) {\n        todo ...\n        System.out.println(\"Dies ist der Beginn eines Kurses, der dir Java beibringen soll.\");\n        todo ... \n        System.out.println(\"Am Ende des Kurses wirst du die Grundlagen der Programmierung mit Java beherrschen\");\n    }\n}"
            },
            {
                "chapter_nr": 3,
                "assignment": "<h2>Aufgabe</h2>\n<p>Erstelle ein Programm, das die folgenden Variablen deklariert und initialisiert:</p>\n<ul>\n    <li>Eine ganze Zahl (int) mit dem Namen <code>alter</code> und dem Wert 16.</li>\n    <li>Eine Dezimalzahl (double) mit dem Namen <code>gewicht</code> und dem Wert 65.5.</li>\n    <li>Ein Zeichen (char) mit dem Namen <code>anfangsBuchstabe</code> und dem Wert 'J'.</li>\n    <li>Ein Wahrheitswert (boolean) mit dem Namen <code>istStudent</code> und dem Wert <code>true</code>.</li>\n</ul>\n<p>Gib anschließend die Werte der Variablen in der Konsole aus.</p><p>Den Wert einer Variable x kann man z.B. mit dem folgenden Befehl ausgeben:</p>\n<pre class=\"western\"><code class=\"western\">System.out.println(\"Wert von x: \" + x);</code></pre>\n<p></p>\n",
                "java": "public class Main {\n    public static void main(String[] args) {\n        todo ...\n    }\n}"
            },
            {
                "chapter_nr": 4,
                "assignment": "<h2>Aufgabe</h2>\n<p>Erstelle ein Programm, das zwei (Dezimal-)Zahlen deklariert und die Aufgaben und Ergebnisse der vier grundlegenden arithmetischen Operationen (Addition, Subtraktion, Multiplikation und Division) ausgibt.</p>\n",
                "java": "public class Main {\n    public static void main(String[] args) {\n        // TODO: Deklariere und initialisiere zwei Variablen mit den Namen zahl1 und zahl2\n        // TODO: Führe die vier grundlegenden arithmetischen Operationen durch \n        // und speichere sie in den Variablen summe, differenz, produkt und quotient\n       int summe = \n       int differenz = \n       int produkt = \n       int quotient = \n       // TODO: Gib die Ergebnisse der Operationen aus\n    }\n}"
            },
            {
                "chapter_nr": 5,
                "assignment": "<h2>Aufgabe</h2>\n<p>Vervollständige das Programm, so dass es nach einem Username fragt und diesen unter der Variable userName abspeichert.\n        Anschließend soll das Programm den Text \"Der Username ist: userName\" ausgeben, wobei userName durch den Wert der Variable ersetzt wird. </p>\n",
                "java": "import java.util.Scanner;\n\nclass Main {\n  public static void main(String[] args) {\n    Scanner scanner = new Scanner(System.in);\n    todo ...\n  }\n}"
            },
            {
                "chapter_nr": 6,
                "assignment": "<h2>Aufgabe</h2>\n<p>Erstelle ein Programm, das eine Zahl vom Benutzer einliest und überprüft, ob die Zahl gerade oder ungerade ist. Gib eine entsprechende Nachricht aus.</p>\n",
                "java": "import java.util.Scanner;\n\nclass Main {\n    public static void main(String[] args) {\n        Scanner scanner = new Scanner(System.in);\n        // TODO: Lese eine Zahl vom Benutzer ein\n        // TODO: Überprüfe, ob die Zahl gerade oder ungerade ist\n        // TODO: Gib die entsprechende Nachricht aus\n    }\n}"
            },
            {
                "chapter_nr": 7,
                "assignment": "<h2>Aufgabe</h2>\n<p>Erstelle ein Programm, das eine Zahl zwischen 1 und 5 einliest und den entsprechenden Wochentag ausgibt. Verwende die <b>switch-case</b> Struktur, um die Wochentage zu definieren.</p>\n",
                "java": "import java.util.Scanner;\n\nclass Main {\n    public static void main(String[] args) {\n        Scanner scanner = new Scanner(System.in);\n        // TODO: Lese eine Zahl zwischen 1 und 5 ein\n        // TODO: Verwende die switch-case Struktur, um den entsprechenden Wochentag auszugeben\n    }\n}"
            },
            {
                "chapter_nr": 8,
                "assignment": "<h2>Aufgabe</h2>\n<p>Erstelle ein Programm, das die Zahlen von 1 bis 10 mit einer for-Schleife ausgibt.</p>\n",
                "java": "public class Main {\n    public static void main(String[] args) {\n        // TODO: Verwende eine for-Schleife, um die Zahlen von 1 bis 10 auszugeben\n    }\n}"
            },
            {
                "chapter_nr": 9,
                "assignment": "<h2>Aufgabe</h2>\n<p>Erstelle ein Programm, das die Zahlen von 10 bis 1 mit einer while-Schleife ausgibt.</p>\n",
                "java": "public class Main {\n    public static void main(String[] args) {\n        // TODO: Verwende eine while-Schleife, um die Zahlen von 10 bis 1 auszugeben\n    }\n}"
            },
            {
                "chapter_nr": 10,
                "assignment": "<h2>Aufgabe</h2>\n<p>Erstelle ein Programm, das die Zahlen von 1 bis 20 ausgibt, aber die Zahlen 5 und 10 überspringt. Verwende dafür die <b>continue</b> Anweisung. Beende die Schleife, wenn die Zahl 15 erreicht ist, indem du die <b>break</b> Anweisung verwendest.</p>\n",
                "java": "public class Main {\n    public static void main(String[] args) {\n        // TODO: Verwende eine Schleife, um die Zahlen von 1 bis 20 auszugeben\n        // TODO: Überspringe die Zahlen 5 und 10 mit continue\n        // TODO: Beende die Schleife, wenn die Zahl 15 erreicht ist mit break\n    }\n}"
            },
            {
                "chapter_nr": 11,
                "assignment": "<h2>Aufgabe</h2>\n<p>Erstelle ein Programm, das eine <code>double</code> Zahl deklariert und diese in eine <code>int</code> Zahl umwandelt. Gib sowohl die ursprüngliche <code>double</code> Zahl als auch die umgewandelte <code>int</code> Zahl aus.</p>\n",
                "java": "public class Main {\n    public static void main(String[] args) {\n        // TODO: Deklariere eine double Zahl\n        // TODO: Wandle die double Zahl in eine int Zahl um\n        // TODO: Gib beide Zahlen aus\n    }\n}"
            },
            {
                "chapter_nr": 12,
                "assignment": "<h2>Aufgabe</h2>\n<p>Erstelle ein Programm, das zwei Zahlen vom Benutzer einliest und die Division der ersten Zahl durch die zweite Zahl durchführt. Für das Einlesen einer Zahl vom Benutzer kannst du du folgenden Befehl verwenden:<pre class=\"western\"><code class=\"western\">scanner.nextInt()</code></pre>\n Stelle sicher, dass die zweite Zahl nicht Null ist, bevor du die Division durchführst. Gib eine entsprechende Fehlermeldung aus, wenn die zweite Zahl Null ist.</p>\n<p>Probiere auch mal aus, was passiert, wenn du doch durch Null teilst.</p>\n",
                "java": "import java.util.Scanner;\n\nclass Main {\n    public static void main(String[] args) {\n        Scanner scanner = new Scanner(System.in);\n        // TODO: Lese zwei Zahlen vom Benutzer ein\n        // TODO: Überprüfe, ob die zweite Zahl Null ist\n        // TODO: Führe die Division durch und gib das Ergebnis aus\n    }\n}"
            },
            {
                "chapter_nr": 13,
                "assignment": "<h2>Aufgabe</h2>\n<p>Erstelle ein Programm, das den Benutzer nach seinem Alter fragt und basierend auf dem Alter eine entsprechende Nachricht ausgibt. Wenn der Benutzer unter 18 Jahre alt ist, gib \"Du bist ein Jugendlicher\" aus. Wenn der Benutzer zwischen 18 und 65 Jahren alt ist, gib \"Du bist ein Erwachsener\" aus. Wenn der Benutzer über 65 Jahre alt ist, gib \"Du bist ein Senior\" aus.</p>\n",
                "java": "import java.util.Scanner;\n\nclass Main {\n    public static void main(String[] args) {\n        Scanner scanner = new Scanner(System.in);\n        // TODO: Frage den Benutzer nach seinem Alter\n        // TODO: Verwende if-else Anweisungen, um die entsprechende Nachricht auszugeben\n    }\n}"
            },
            {
                "chapter_nr": 14,
                "assignment": "<h2>Aufgabe</h2>\n<p>Erstelle ein Programm, das ein Array von 5 ganzen Zahlen deklariert, diese initialisiert und anschließend die Werte des Arrays in der Konsole ausgibt.</p>\n",
                "java": "public class Main {\n    public static void main(String[] args) {\n        // TODO: Deklariere und initialisiere ein Array von 5 ganzen Zahlen\n        // TODO: Gib die Werte des Arrays in der Konsole aus.\n    }\n}"
            },
            {
                "chapter_nr": 15,
                "assignment": "<h2>Aufgabe</h2>\n<p>Erstelle ein Programm, das ein Array von 5 ganzen Zahlen deklariert, diese mit Werten initialisiert und dann die Werte verdoppelt. Gib die ursprünglichen und die verdoppelten Werte in der Konsole aus. Verwende eine for-Schleife zur Verdoppelung und Ausgabe der Werte des Arrays.</p>\n",
                "java": "public class Main {\n    public static void main(String[] args) {\n        // TODO: Deklariere und initialisiere ein Array von 5 ganzen Zahlen\n        // TODO: Verwende eine Schleife, um die Werte im Array zu verdoppeln und die ursprünlichen und verdoppelten Werte auszugeben.\n    }\n}"
            },
            {
                "chapter_nr": 16,
                "assignment": "<h2>Aufgabe</h2>\n<p>Erstelle ein Programm, das ein zweidimensionales Array von 3x3 deklariert, es mit Werten initialisiert und anschließend die Werte des Arrays in der Konsole ausgibt. Verwende zur Ausgabe der Werte zwei verschachtelte for-Schleifen.</p>\n",
                "java": "public class Main {\n    public static void main(String[] args) {\n        // TODO: Deklariere und initialisiere ein zweidimensionales Array von 3x3\n        // TODO: Gib die Werte des Arrays in der Konsole aus. Verwnde dazu zwei verschachtelte for-Schleifen.\n    }\n}"
            },
            {
                "chapter_nr": 17,
                "assignment": "<h2>Aufgabe</h2>\n<p>Erstelle ein Programm, das eine Methode deklariert, die eine einfache Nachricht ausgibt. Rufe diese Methode in der <code>main</code> Methode drei mal auf.</p>\n",
                "java": "public class Main {\n    public static void main(String[] args) {\n        // TODO: Rufe deine Methode drei mal auf\n    }\n\n    //TODO: Deklariere und erstelle deine Methode, die einen einfachen Text ausgibt.\n}"
            },
            {
                "chapter_nr": 18,
                "assignment": "<h2>Aufgabe</h2>\n<p>Erstelle ein Programm, das eine Methode deklariert, die zwei Zahlen als Parameter entgegennimmt und deren Summe ausgibt. Rufe diese Methode in der <code>main</code> Methode mit verschiedenen Zahlen auf.</p>\n",
                "java": "public class Main {\n    public static void main(String[] args) {\n        // TODO: Rufe deine Methode mit verschiedenen Zahlen auf\n    }\n\n    //TODO: Deklariere und erstelle deine Methode, die zwei Zahlen als Parameter entgegennimmt und deren Summe ausgibt.\n}"
            },
            {
                "chapter_nr": 19,
                "assignment": "<h2>Aufgabe</h2>\n<p>Erstelle ein Programm, das eine Methode deklariert, die den Quadratwert einer Zahl berechnet und zurückgibt. Rufe diese Methode in der <code>main</code> Methode auf und gib das Ergebnis aus.</p>\n",
                "java": "public class Main {\n    public static void main(String[] args) {\n        // TODO: Rufe deine Methode auf und gib das Ergebnis aus\n    }\n\n    //TODO: Deklariere und erstelle deine Methode, die den Quadratwert einer Zahl berechnet und zurückgibt.\n}"
            },
            {
                "chapter_nr": 20,
                "assignment": "<h2>Aufgabe</h2>\n<p>Erstelle eine Klasse namens <code>Person</code>, die die Attribute <code>name</code> (String) und <code>alter</code> (int) hat. Erstelle dann ein Objekt der Klasse <code>Person</code> und gib den Attributen entsprechende Werte. Gib anschließend die Werte der Attribute auf der Konsole aus.</p>\n</p>",
                "java": "// TODO: Erstelle eine Klasse mit dem Namen Person mit den Attributen name und alter.\n\n\npublic class Main {\n    public static void main(String[] args) {\n        // TODO: Erstelle ein Objekt der Klasse Person, setze die Attribute und gib sie auf der Konsole aus.\n    }\n}"
            },
            {
                "chapter_nr": 21,
                "assignment": "<h2>Aufgabe</h2>\n<p>Erstelle eine Klasse namens <code>Rechner</code>, die eine Methode <code>addiere</code> hat, die zwei Zahlen als Parameter entgegennimmt und deren Summe zurückgibt. Erstelle dann ein Objekt der Klasse <code>Rechner</code> in der <code>main</code> Methode und rufe die <code>addiere</code> Methode auf, um die Summe von zwei Zahlen zu berechnen und auszugeben.</p>\n",
                "java": "class Rechner {\n    // TODO: Definiere die Methode addiere, die zwei Zahlen addiert und zurückgibt\n}\n\npublic class Main {\n    public static void main(String[] args) {\n        // TODO: Erstelle ein Objekt der Klasse Rechner und rufe die addiere Methode auf\n    }\n}"
            },
            {
                "chapter_nr": 22,
                "assignment": "<h2>Aufgabe</h2>\n<p>Erstelle eine Klasse namens <code>Person</code>, die die Instanzvariablen <code>name</code> (String) und <code>alter</code> (int) und eine Methode <code>vorstellen</code> hat. Füge einen Konstruktor hinzu, der die Variablen initialisiert. Erstelle dann ein Objekt der Klasse <code>Person</code> in der <code>main</code> Methode und gib die Werte der Instanzvariablen mit Hilfe der <code>vorstellen</code> Methode aus.</p>\n",
                "java": "// TODO: Erstelle eine Klasse Person mit den geforderten Attributen und Methode.\n\npublic class Main {\n    public static void main(String[] args) {\n        // TODO: Erstelle ein Objekt der Klasse Person und gib die Werte der Instanzvariablen aus\n    }\n}"
            },
            {
                "chapter_nr": 23,
                "assignment": "<h2>Aufgabe</h2>\n    <p>Erstelle ein Programm, das die Vererbung zwischen verschiedenen Tierarten demonstriert und dabei die\n\t\tBesonderheiten der Tiere hervorhebt. Du kannst das Programm erweitern, um\n\t\tauch andere Tiere wie Vögel oder Fische einzubeziehen.</p>\n\t<p>Erstelle eine Basis-Klasse Tier, die allgemeine Eigenschaften und Methoden für Tiere definiert.</p>\n\t<p>Erstelle dann zwei spezialisierte Klassen, Hund und Katze, die von der Klasse Tier erben.</p>\n\t<p>Die Klassen sollen folgende Anforderungen erfüllen:</p>\n\t<p>Basis-Klasse Tier:</p>\n\t<ul>\n\t\t<li>Attribut: name (String) - Der Name des Tieres.</li>\n\t\t<li>Attribut: gewicht (double) - Das Gewicht des Tieres.</li>\n\t</ul>\n\t<p>Klasse Hund:</p>\n\t<ul>\n\t\t<li>Erbt von der Klasse Tier.</li>\n\t\t<li>Methode: geraeuschMachen() - Gibt &quot;Hund bellt: Wuff, Wuff!&quot; aus.</li>\n\t\t<li>Methode: apportieren() - Gibt &quot;Hund apportiert den Ball!&quot; aus.</li>\n\t</ul>\n\t<p>Klasse Katze:</p>\n\t<ul>\n\t\t<li>Erbt von der Klasse Tier.</li>\n\t\t<li>Methode: geraeuschMachen() - Gibt &quot;Katze miaut: Miau, Miau!&quot; aus.</li>\n\t\t<li>Methode: kratzen() - Gibt &quot;Katze kratzt das Sofa!&quot; aus.</li>\n\t</ul>\n\t<p>main-Klasse:</p>\n\t<ul>\n\t\t<li>Erstelle in der main-Methode ein Objekt von der Klasse Hund und eines von der Klasse Katze.</li>\n\t\t<li>Rufe die Methode geraeuschMachen() für beide Objekte auf.</li>\n\t\t<li>Rufe die Methoden apportieren() und kratzen() für die entsprechenden Objekte auf.</li>\n\t\t<li>Gib die Attribute name und gewicht für beide Objekte aus.</li>\n\t\t<li>Zusätzlich: Überlege dir, welche besonderen Eigenschaften oder Verhaltensweisen du für andere Tiere\n\t\t\thinzufügen könntest, und implementiere diese als neue Klassen.</li>\n\t</ul>\n",
                "java": "// Basis-Klasse Tier\nclass Tier {\n    todo ...\n}\n\n// Spezialisierte Klasse Hund, erbt von Tier\nclass Hund extends Tier {\n    todo ...\n}\n\n// Spezialisierte Klasse Katze, erbt von Tier\nclass Katze extends Tier {\n\n    // Konstruktor\n    public Katze(String name, double gewicht) {\n        super(name, gewicht);\n    }\n\n    todo ...\n\n}\n\n// Main-Klasse zum Testen\npublic class Main {\n    public static void main(String[] args) {\n        todo ...\n    }\n}\n"
            },
            {
                "chapter_nr": 24,
                "assignment": "<h2>Aufgabe</h2>\n<p>Erstelle eine Basisklasse <code>Fahrzeug</code> mit einer Methode <code>fahren</code>, die eine allgemeine Nachricht ausgibt. Erstelle dann zwei abgeleitete Klassen <code>Auto</code> und <code>Motorrad</code>, die die Methode <code>fahren</code> überschreiben und spezifische Nachrichten ausgeben. Erstelle in der <code>main</code> Methode ein Objekt jeder Klasse und rufe die <code>fahren</code> Methode auf.</p>\n",
                "java": "class Fahrzeug {\n    todo ...\n}\n\nclass Auto extends Fahrzeug {\n    todo ...\n}\n\nclass Motorrad extends Fahrzeug {\n    todo ...\n}\n\npublic class Main {\n    public static void main(String[] args) {\n        // TODO: Erstelle ein Objekt von Auto und Motorrad und rufe die fahren Methode auf\n    }\n}"
            },
            {
                "chapter_nr": 25,
                "assignment": "<h2>Aufgabe</h2>\n<p>Erstelle eine Klasse <code>Fahrzeug</code> mit einem Attribut <code>geschwindigkeit</code> und einer Methode <code>fahren</code>, die die Geschwindigkeit ausgibt. Erstelle dann eine Klasse <code>Auto</code>, die von <code>Fahrzeug</code> erbt und einen Konstruktor hat, der die Geschwindigkeit über das <code>super</code> Schlüsselwort initialisiert. Rufe die Methode <code>fahren</code> in der <code>main</code> Methode auf.</p>\n",
                "java": "todo ..."
            }
        ]
    },
    "peter": {
        "password_hash": "$2b$12$FXVL6mDmdT0cEjNMlMehVO2Keo4B/yqKtcA8cviCet81UAJLlc50W",
        "assignment_chapter": 11,
        "current_chapter": 11,
        "preferences": {
            "set": true,
            "favorite_subjects": "Musik, Kunst",
            "hobbies": "Flöte und Klavier spielen",
            "profession": "Bildhauer",
            "other": "Ich höre gerne klassische Musik."
        },
        "data": [
            {
                "chapter_nr": 1,
                "assignment": "\n<h2>Aufgabe</h2>\n<p>Verändere das Programm so, dass es anstelle von \"Hallo Welt\" die Worte \"Hello World\" ausgibt. Um das Ganze interessanter zu gestalten, füge eine musikalische Note hinzu: Lass das Programm zusätzlich eine kurze Melodie abspielen, während es die Nachricht ausgibt. Du kannst dafür die <code>javax.sound.sampled</code> Bibliothek verwenden, um einen einfachen Soundeffekt zu erzeugen. Viel Spaß beim Programmieren!</p>\n",
                "java": "public class Main {\n    public static void main(String[] args) {\n        System.out.println(\"Hallo Welt!\");\n    }\n}"
            },
            {
                "chapter_nr": 2,
                "assignment": "\n<h2>Aufgabe</h2>\n<p>Füge deinem Programm Kommentare hinzu, um zu erklären, was jeder Teil des Codes macht. Denke daran, dass Kommentare wie Noten in einem Musikstück sind – sie helfen, die Struktur und den Fluss zu verstehen. Erstelle sowohl einzeilige als auch mehrzeilige Kommentare, um die verschiedenen Abschnitte deines Codes zu erläutern.</p>\n<p>Zusätzlich kannst du kreativ sein und die Kommentare so gestalten, dass sie zu deinem Interesse an Kunst und Musik passen. Vielleicht kannst du sogar eine kleine musikalische Anspielung in deinen Kommentaren einbauen!</p>\n",
                "java": "\npublic class Main {\n    public static void main(String[] args) {\n        // todo ... (Hier kannst du eine kurze Einführung in dein Programm geben)\n        System.out.println(\"Dies ist der Beginn eines Kurses, der dir Java beibringen soll.\");\n        // todo ... (Hier kannst du erklären, was der nächste Schritt im Programm ist)\n        System.out.println(\"Am Ende des Kurses wirst du die Grundlagen der Programmierung mit Java beherrschen\");\n    }\n}\n"
            },
            {
                "chapter_nr": 3,
                "assignment": "\n<h2>Aufgabe</h2>\n<p>Stell dir vor, du bist ein Bildhauer und möchtest eine kleine Skulptur aus verschiedenen Materialien erstellen. Erstelle ein Programm, das die folgenden Variablen deklariert und initialisiert:</p>\n<ul>\n    <li>Eine ganze Zahl (int) mit dem Namen <code>alter</code> und dem Wert 16, die dein Alter repräsentiert.</li>\n    <li>Eine Dezimalzahl (double) mit dem Namen <code>gewicht</code> und dem Wert 65.5, die das Gewicht deiner Skulptur in Kilogramm darstellt.</li>\n    <li>Ein Zeichen (char) mit dem Namen <code>anfangsBuchstabe</code> und dem Wert 'J', das den Anfangsbuchstaben deines Lieblingskünstlers symbolisiert.</li>\n    <li>Ein Wahrheitswert (boolean) mit dem Namen <code>istStudent</code> und dem Wert <code>true</code>, der angibt, ob du noch Schüler bist.</li>\n</ul>\n<p>Gib anschließend die Werte der Variablen in der Konsole aus, um deine künstlerische Identität zu zeigen.</p>\n<p>Den Wert einer Variable x kannst du z.B. mit dem folgenden Befehl ausgeben:</p>\n<pre class=\"western\"><code class=\"western\">System.out.println(\"Wert von x: \" + x);</code></pre>\n",
                "java": "\npublic class Main {\n    public static void main(String[] args) {\n        // Deklariere und initialisiere die Variablen\n        int alter = 16; // Dein Alter\n        double gewicht = 65.5; // Gewicht der Skulptur\n        char anfangsBuchstabe = 'J'; // Anfangsbuchstabe deines Lieblingskünstlers\n        boolean istStudent = true; // Bist du noch Schüler?\n\n        // todo: Gib die Werte der Variablen in der Konsole aus\n    }\n}\n"
            },
            {
                "chapter_nr": 4,
                "assignment": "\n<h2>Aufgabe</h2>\n<p>Stell dir vor, du bist ein Bildhauer, der mit verschiedenen Materialien arbeitet. Um die Kosten für dein Projekt zu berechnen, musst du mit Zahlen arbeiten. Erstelle ein Programm, das zwei (Dezimal-)Zahlen deklariert, die die Kosten für zwei verschiedene Materialien darstellen. Berechne die Gesamtkosten, die Einsparungen, die du durch den Kauf eines günstigeren Materials erzielst, sowie die Kosten pro Einheit für jedes Material. Gib die Ergebnisse der vier grundlegenden arithmetischen Operationen (Addition, Subtraktion, Multiplikation und Division) aus.</p>\n",
                "java": "\npublic class Main {\n    public static void main(String[] args) {\n        // TODO: Deklariere und initialisiere zwei Variablen mit den Namen material1 und material2\n        // TODO: Führe die vier grundlegenden arithmetischen Operationen durch \n        // und speichere sie in den Variablen gesamtKosten, einsparungen, kostenProEinheit1 und kostenProEinheit2\n        double gesamtKosten = \n        double einsparungen = \n        double kostenProEinheit1 = \n        double kostenProEinheit2 = \n        // TODO: Gib die Ergebnisse der Operationen aus\n    }\n}\n"
            },
            {
                "chapter_nr": 5,
                "assignment": "\n<h2>Aufgabe</h2>\n<p>Stelle dir vor, du bist ein berühmter Bildhauer und möchtest, dass die Menschen deinen Kunstwerken einen Namen geben. Vervollständige das Programm, so dass es nach einem Username fragt, der den Namen deines Kunstwerks repräsentiert, und diesen unter der Variable <code>userName</code> abspeichert. Anschließend soll das Programm den Text \"Der Username ist: <code>userName</code>\" ausgeben, wobei <code>userName</code> durch den Wert der Variable ersetzt wird. Lass deiner Kreativität freien Lauf und denke daran, dass jeder Name eine Geschichte erzählt!</p>\n",
                "java": "\nimport java.util.Scanner;\n\nclass Main {\n  public static void main(String[] args) {\n    Scanner scanner = new Scanner(System.in);\n    // todo: Frage nach dem Username und speichere ihn in der Variable userName\n  }\n}\n"
            },
            {
                "chapter_nr": 6,
                "assignment": "\n<h2>Aufgabe</h2>\n<p>Erstelle ein Programm, das eine Zahl vom Benutzer einliest und überprüft, ob die Zahl gerade oder ungerade ist. Um das Ganze interessanter zu gestalten, füge eine musikalische Note hinzu: Wenn die Zahl gerade ist, gib eine Nachricht aus, die mit einem Musikbeispiel verknüpft ist, und wenn die Zahl ungerade ist, erwähne ein Kunstwerk oder einen Künstler, der dich inspiriert. Gib die entsprechenden Nachrichten aus!</p>\n",
                "java": "\nimport java.util.Scanner;\n\nclass Main {\n    public static void main(String[] args) {\n        Scanner scanner = new Scanner(System.in);\n        // TODO: Lese eine Zahl vom Benutzer ein\n        // TODO: Überprüfe, ob die Zahl gerade oder ungerade ist\n        // TODO: Gib die entsprechende Nachricht aus, die mit Musik oder Kunst verknüpft ist\n    }\n}\n"
            },
            {
                "chapter_nr": 7,
                "assignment": "\n<h2>Aufgabe</h2>\n<p>Stell dir vor, du bist ein Komponist, der die Wochentage mit verschiedenen Musikstilen verbindet. Erstelle ein Programm, das eine Zahl zwischen 1 und 5 einliest und den entsprechenden Wochentag zusammen mit einem Musikstil ausgibt, der zu diesem Tag passt. Verwende die <b>switch-case</b> Struktur, um die Wochentage und die dazugehörigen Musikstile zu definieren. Zum Beispiel könnte Montag mit klassischer Musik und Freitag mit Popmusik assoziiert werden.</p>\n",
                "java": "\nimport java.util.Scanner;\n\nclass Main {\n    public static void main(String[] args) {\n        Scanner scanner = new Scanner(System.in);\n        // TODO: Lese eine Zahl zwischen 1 und 5 ein\n        // TODO: Verwende die switch-case Struktur, um den entsprechenden Wochentag und Musikstil auszugeben\n    }\n}\n"
            },
            {
                "chapter_nr": 8,
                "assignment": "\n<h2>Aufgabe</h2>\n<p>Erstelle ein Programm, das die Zahlen von 1 bis 10 mit einer for-Schleife ausgibt. Um das Ganze interessanter zu gestalten, füge eine kleine musikalische Note hinzu: Lass das Programm für jede ausgegebene Zahl eine kurze Nachricht anzeigen, die mit Musik zu tun hat, wie z.B. \"Die Zahl 1 - Zeit für ein Flötenspiel!\" oder \"Die Zahl 2 - Lass die Klänge des Klaviers erklingen!\". Sei kreativ und denke dir eigene Nachrichten aus!</p>\n",
                "java": "\npublic class Main {\n    public static void main(String[] args) {\n        // TODO: Verwende eine for-Schleife, um die Zahlen von 1 bis 10 auszugeben\n        // und füge für jede Zahl eine kreative musikalische Nachricht hinzu.\n    }\n}\n"
            },
            {
                "chapter_nr": 9,
                "assignment": "\n<h2>Aufgabe</h2>\n<p>Erstelle ein Programm, das die Zahlen von 10 bis 1 mit einer while-Schleife ausgibt. Um das Ganze interessanter zu gestalten, füge eine musikalische Note hinzu: Bei jeder Zahl, die ausgegeben wird, soll eine kurze Nachricht erscheinen, die eine Musikrichtung oder ein Instrument erwähnt, das du magst. Zum Beispiel: \"10 - Klassische Musik\", \"9 - Flöte\", \"8 - Klavier\" usw. Überlege dir, welche Musikrichtungen oder Instrumente du verwenden möchtest!</p>\n",
                "java": "\npublic class Main {\n    public static void main(String[] args) {\n        // TODO: Verwende eine while-Schleife, um die Zahlen von 10 bis 1 auszugeben\n        // TODO: Füge eine musikalische Nachricht für jede Zahl hinzu\n    }\n}\n"
            },
            {
                "chapter_nr": 10,
                "assignment": "\n<h2>Aufgabe</h2>\n<p>Stell dir vor, du bist ein Bildhauer, der mit verschiedenen Materialien arbeitet. Erstelle ein Programm, das die Zahlen von 1 bis 20 ausgibt, aber die Zahlen 5 und 10 überspringt, als ob du diese Materialien nicht verwenden möchtest. Nutze dafür die <b>continue</b> Anweisung. Beende die Schleife, wenn die Zahl 15 erreicht ist, indem du die <b>break</b> Anweisung verwendest. So kannst du die Kontrolle über deine \"Skulpturen\" behalten und nur die gewünschten Zahlen ausgeben.</p>\n",
                "java": "\npublic class Main {\n    public static void main(String[] args) {\n        // TODO: Verwende eine Schleife, um die Zahlen von 1 bis 20 auszugeben\n        // TODO: Überspringe die Zahlen 5 und 10 mit continue\n        // TODO: Beende die Schleife, wenn die Zahl 15 erreicht ist mit break\n    }\n}\n"
            },
            {
                "chapter_nr": 11,
                "assignment": "\n<h2>Aufgabe</h2>\n<p>Stell dir vor, du bist ein Bildhauer, der mit verschiedenen Materialien arbeitet. In dieser Aufgabe wirst du ein Programm erstellen, das eine <code>double</code> Zahl deklariert, die die Höhe einer Skulptur in Metern darstellt. Diese Zahl wird dann in eine <code>int</code> Zahl umgewandelt, die die Höhe in Zentimetern angibt. Gib sowohl die ursprüngliche <code>double</code> Zahl als auch die umgewandelte <code>int</code> Zahl aus, um zu zeigen, wie hoch deine Skulptur ist!</p>\n",
                "java": "\npublic class Main {\n    public static void main(String[] args) {\n        // TODO: Deklariere eine double Zahl für die Höhe der Skulptur in Metern\n        // TODO: Wandle die double Zahl in eine int Zahl für die Höhe in Zentimetern um\n        // TODO: Gib beide Höhen aus\n    }\n}\n"
            },
            {
                "chapter_nr": 12,
                "assignment": "<h2>Aufgabe</h2>\n<p>Erstelle ein Programm, das zwei Zahlen vom Benutzer einliest und die Division der ersten Zahl durch die zweite Zahl durchführt. Für das Einlesen einer Zahl vom Benutzer kannst du du folgenden Befehl verwenden:<pre class=\"western\"><code class=\"western\">scanner.nextInt()</code></pre>\n Stelle sicher, dass die zweite Zahl nicht Null ist, bevor du die Division durchführst. Gib eine entsprechende Fehlermeldung aus, wenn die zweite Zahl Null ist.</p>\n<p>Probiere auch mal aus, was passiert, wenn du doch durch Null teilst.</p>\n",
                "java": "import java.util.Scanner;\n\nclass Main {\n    public static void main(String[] args) {\n        Scanner scanner = new Scanner(System.in);\n        // TODO: Lese zwei Zahlen vom Benutzer ein\n        // TODO: Überprüfe, ob die zweite Zahl Null ist\n        // TODO: Führe die Division durch und gib das Ergebnis aus\n    }\n}"
            },
            {
                "chapter_nr": 13,
                "assignment": "<h2>Aufgabe</h2>\n<p>Erstelle ein Programm, das den Benutzer nach seinem Alter fragt und basierend auf dem Alter eine entsprechende Nachricht ausgibt. Wenn der Benutzer unter 18 Jahre alt ist, gib \"Du bist ein Jugendlicher\" aus. Wenn der Benutzer zwischen 18 und 65 Jahren alt ist, gib \"Du bist ein Erwachsener\" aus. Wenn der Benutzer über 65 Jahre alt ist, gib \"Du bist ein Senior\" aus.</p>\n",
                "java": "import java.util.Scanner;\n\nclass Main {\n    public static void main(String[] args) {\n        Scanner scanner = new Scanner(System.in);\n        // TODO: Frage den Benutzer nach seinem Alter\n        // TODO: Verwende if-else Anweisungen, um die entsprechende Nachricht auszugeben\n    }\n}"
            },
            {
                "chapter_nr": 14,
                "assignment": "<h2>Aufgabe</h2>\n<p>Erstelle ein Programm, das ein Array von 5 ganzen Zahlen deklariert, diese initialisiert und anschließend die Werte des Arrays in der Konsole ausgibt.</p>\n",
                "java": "public class Main {\n    public static void main(String[] args) {\n        // TODO: Deklariere und initialisiere ein Array von 5 ganzen Zahlen\n        // TODO: Gib die Werte des Arrays in der Konsole aus.\n    }\n}"
            },
            {
                "chapter_nr": 15,
                "assignment": "<h2>Aufgabe</h2>\n<p>Erstelle ein Programm, das ein Array von 5 ganzen Zahlen deklariert, diese mit Werten initialisiert und dann die Werte verdoppelt. Gib die ursprünglichen und die verdoppelten Werte in der Konsole aus. Verwende eine for-Schleife zur Verdoppelung und Ausgabe der Werte des Arrays.</p>\n",
                "java": "public class Main {\n    public static void main(String[] args) {\n        // TODO: Deklariere und initialisiere ein Array von 5 ganzen Zahlen\n        // TODO: Verwende eine Schleife, um die Werte im Array zu verdoppeln und die ursprünlichen und verdoppelten Werte auszugeben.\n    }\n}"
            },
            {
                "chapter_nr": 16,
                "assignment": "<h2>Aufgabe</h2>\n<p>Erstelle ein Programm, das ein zweidimensionales Array von 3x3 deklariert, es mit Werten initialisiert und anschließend die Werte des Arrays in der Konsole ausgibt. Verwende zur Ausgabe der Werte zwei verschachtelte for-Schleifen.</p>\n",
                "java": "public class Main {\n    public static void main(String[] args) {\n        // TODO: Deklariere und initialisiere ein zweidimensionales Array von 3x3\n        // TODO: Gib die Werte des Arrays in der Konsole aus. Verwnde dazu zwei verschachtelte for-Schleifen.\n    }\n}"
            },
            {
                "chapter_nr": 17,
                "assignment": "<h2>Aufgabe</h2>\n<p>Erstelle ein Programm, das eine Methode deklariert, die eine einfache Nachricht ausgibt. Rufe diese Methode in der <code>main</code> Methode drei mal auf.</p>\n",
                "java": "public class Main {\n    public static void main(String[] args) {\n        // TODO: Rufe deine Methode drei mal auf\n    }\n\n    //TODO: Deklariere und erstelle deine Methode, die einen einfachen Text ausgibt.\n}"
            },
            {
                "chapter_nr": 18,
                "assignment": "<h2>Aufgabe</h2>\n<p>Erstelle ein Programm, das eine Methode deklariert, die zwei Zahlen als Parameter entgegennimmt und deren Summe ausgibt. Rufe diese Methode in der <code>main</code> Methode mit verschiedenen Zahlen auf.</p>\n",
                "java": "public class Main {\n    public static void main(String[] args) {\n        // TODO: Rufe deine Methode mit verschiedenen Zahlen auf\n    }\n\n    //TODO: Deklariere und erstelle deine Methode, die zwei Zahlen als Parameter entgegennimmt und deren Summe ausgibt.\n}"
            },
            {
                "chapter_nr": 19,
                "assignment": "<h2>Aufgabe</h2>\n<p>Erstelle ein Programm, das eine Methode deklariert, die den Quadratwert einer Zahl berechnet und zurückgibt. Rufe diese Methode in der <code>main</code> Methode auf und gib das Ergebnis aus.</p>\n",
                "java": "public class Main {\n    public static void main(String[] args) {\n        // TODO: Rufe deine Methode auf und gib das Ergebnis aus\n    }\n\n    //TODO: Deklariere und erstelle deine Methode, die den Quadratwert einer Zahl berechnet und zurückgibt.\n}"
            },
            {
                "chapter_nr": 20,
                "assignment": "<h2>Aufgabe</h2>\n<p>Erstelle eine Klasse namens <code>Person</code>, die die Attribute <code>name</code> (String) und <code>alter</code> (int) hat. Erstelle dann ein Objekt der Klasse <code>Person</code> und gib den Attributen entsprechende Werte. Gib anschließend die Werte der Attribute auf der Konsole aus.</p>\n</p>",
                "java": "// TODO: Erstelle eine Klasse mit dem Namen Person mit den Attributen name und alter.\n\n\npublic class Main {\n    public static void main(String[] args) {\n        // TODO: Erstelle ein Objekt der Klasse Person, setze die Attribute und gib sie auf der Konsole aus.\n    }\n}"
            },
            {
                "chapter_nr": 21,
                "assignment": "<h2>Aufgabe</h2>\n<p>Erstelle eine Klasse namens <code>Rechner</code>, die eine Methode <code>addiere</code> hat, die zwei Zahlen als Parameter entgegennimmt und deren Summe zurückgibt. Erstelle dann ein Objekt der Klasse <code>Rechner</code> in der <code>main</code> Methode und rufe die <code>addiere</code> Methode auf, um die Summe von zwei Zahlen zu berechnen und auszugeben.</p>\n",
                "java": "class Rechner {\n    // TODO: Definiere die Methode addiere, die zwei Zahlen addiert und zurückgibt\n}\n\npublic class Main {\n    public static void main(String[] args) {\n        // TODO: Erstelle ein Objekt der Klasse Rechner und rufe die addiere Methode auf\n    }\n}"
            },
            {
                "chapter_nr": 22,
                "assignment": "<h2>Aufgabe</h2>\n<p>Erstelle eine Klasse namens <code>Person</code>, die die Instanzvariablen <code>name</code> (String) und <code>alter</code> (int) und eine Methode <code>vorstellen</code> hat. Füge einen Konstruktor hinzu, der die Variablen initialisiert. Erstelle dann ein Objekt der Klasse <code>Person</code> in der <code>main</code> Methode und gib die Werte der Instanzvariablen mit Hilfe der <code>vorstellen</code> Methode aus.</p>\n",
                "java": "// TODO: Erstelle eine Klasse Person mit den geforderten Attributen und Methode.\n\npublic class Main {\n    public static void main(String[] args) {\n        // TODO: Erstelle ein Objekt der Klasse Person und gib die Werte der Instanzvariablen aus\n    }\n}"
            },
            {
                "chapter_nr": 23,
                "assignment": "<h2>Aufgabe</h2>\n    <p>Erstelle ein Programm, das die Vererbung zwischen verschiedenen Tierarten demonstriert und dabei die\n\t\tBesonderheiten der Tiere hervorhebt. Du kannst das Programm erweitern, um\n\t\tauch andere Tiere wie Vögel oder Fische einzubeziehen.</p>\n\t<p>Erstelle eine Basis-Klasse Tier, die allgemeine Eigenschaften und Methoden für Tiere definiert.</p>\n\t<p>Erstelle dann zwei spezialisierte Klassen, Hund und Katze, die von der Klasse Tier erben.</p>\n\t<p>Die Klassen sollen folgende Anforderungen erfüllen:</p>\n\t<p>Basis-Klasse Tier:</p>\n\t<ul>\n\t\t<li>Attribut: name (String) - Der Name des Tieres.</li>\n\t\t<li>Attribut: gewicht (double) - Das Gewicht des Tieres.</li>\n\t</ul>\n\t<p>Klasse Hund:</p>\n\t<ul>\n\t\t<li>Erbt von der Klasse Tier.</li>\n\t\t<li>Methode: geraeuschMachen() - Gibt &quot;Hund bellt: Wuff, Wuff!&quot; aus.</li>\n\t\t<li>Methode: apportieren() - Gibt &quot;Hund apportiert den Ball!&quot; aus.</li>\n\t</ul>\n\t<p>Klasse Katze:</p>\n\t<ul>\n\t\t<li>Erbt von der Klasse Tier.</li>\n\t\t<li>Methode: geraeuschMachen() - Gibt &quot;Katze miaut: Miau, Miau!&quot; aus.</li>\n\t\t<li>Methode: kratzen() - Gibt &quot;Katze kratzt das Sofa!&quot; aus.</li>\n\t</ul>\n\t<p>main-Klasse:</p>\n\t<ul>\n\t\t<li>Erstelle in der main-Methode ein Objekt von der Klasse Hund und eines von der Klasse Katze.</li>\n\t\t<li>Rufe die Methode geraeuschMachen() für beide Objekte auf.</li>\n\t\t<li>Rufe die Methoden apportieren() und kratzen() für die entsprechenden Objekte auf.</li>\n\t\t<li>Gib die Attribute name und gewicht für beide Objekte aus.</li>\n\t\t<li>Zusätzlich: Überlege dir, welche besonderen Eigenschaften oder Verhaltensweisen du für andere Tiere\n\t\t\thinzufügen könntest, und implementiere diese als neue Klassen.</li>\n\t</ul>\n",
                "java": "// Basis-Klasse Tier\nclass Tier {\n    todo ...\n}\n\n// Spezialisierte Klasse Hund, erbt von Tier\nclass Hund extends Tier {\n    todo ...\n}\n\n// Spezialisierte Klasse Katze, erbt von Tier\nclass Katze extends Tier {\n\n    // Konstruktor\n    public Katze(String name, double gewicht) {\n        super(name, gewicht);\n    }\n\n    todo ...\n\n}\n\n// Main-Klasse zum Testen\npublic class Main {\n    public static void main(String[] args) {\n        todo ...\n    }\n}\n"
            },
            {
                "chapter_nr": 24,
                "assignment": "<h2>Aufgabe</h2>\n<p>Erstelle eine Basisklasse <code>Fahrzeug</code> mit einer Methode <code>fahren</code>, die eine allgemeine Nachricht ausgibt. Erstelle dann zwei abgeleitete Klassen <code>Auto</code> und <code>Motorrad</code>, die die Methode <code>fahren</code> überschreiben und spezifische Nachrichten ausgeben. Erstelle in der <code>main</code> Methode ein Objekt jeder Klasse und rufe die <code>fahren</code> Methode auf.</p>\n",
                "java": "class Fahrzeug {\n    todo ...\n}\n\nclass Auto extends Fahrzeug {\n    todo ...\n}\n\nclass Motorrad extends Fahrzeug {\n    todo ...\n}\n\npublic class Main {\n    public static void main(String[] args) {\n        // TODO: Erstelle ein Objekt von Auto und Motorrad und rufe die fahren Methode auf\n    }\n}"
            },
            {
                "chapter_nr": 25,
                "assignment": "<h2>Aufgabe</h2>\n<p>Erstelle eine Klasse <code>Fahrzeug</code> mit einem Attribut <code>geschwindigkeit</code> und einer Methode <code>fahren</code>, die die Geschwindigkeit ausgibt. Erstelle dann eine Klasse <code>Auto</code>, die von <code>Fahrzeug</code> erbt und einen Konstruktor hat, der die Geschwindigkeit über das <code>super</code> Schlüsselwort initialisiert. Rufe die Methode <code>fahren</code> in der <code>main</code> Methode auf.</p>\n",
                "java": "todo ..."
            }
        ]
    }
}